{
  "jurisdiction": "US-DE",
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "VIII"
    },
    {
      "subdivision": "section",
      "number": "241"
    }
  ],
  "heading": "Amendment of certificate of incorporation before receipt of payment for stock",
  "content": [
    {
      "number": "(a)",
      "content": "Before a corporation has received any payment for any of its stock, it may amend its certificate of incorporation at any time or times, in any and as many respects as may be desired, so long as its certificate of incorporation as amended would contain only such provisions as it would be lawful and proper to insert in an original certificate of incorporation filed at the time of filing the amendment."
    },
    {
      "number": "(b)",
      "content": "The amendment of a certificate of incorporation authorized by this section shall be adopted by a majority of the incorporators, if directors were not named in the original certificate of incorporation or have not yet been elected, or, if directors were named in the original certificate of incorporation or have been elected and have qualified, by a majority of the directors. A certificate setting forth the amendment and certifying that the corporation has not received any payment for any of its stock, or that the corporation has no members, as applicable, and that the amendment has been duly adopted in accordance with this section shall be executed, acknowledged and filed in accordance with § 103 of this title. Upon such filing, the corporation’s certificate of incorporation shall be deemed to be amended accordingly as of the date on which the original certificate of incorporation became effective, except as to those persons who are substantially and adversely affected by the amendment and as to those persons the amendment shall be effective from the filing date."
    },
    {
      "number": "(c)",
      "content": "This section will apply to a nonstock corporation before such a corporation has any members; provided, however, that all references to directors shall be deemed to be references to members of the governing body of the corporation."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 241",
    "56 Del. Laws, c. 50",
    "64 Del. Laws, c. 112, § 23",
    "70 Del. Laws, c. 587, § 13",
    "77 Del. Laws, c. 253, §§ 31, 32"
  ]
}
