{
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "VIII"
    },
    {
      "subdivision": "section",
      "number": "242"
    }
  ],
  "heading": "Amendment of certificate of incorporation after receipt of payment for stock; nonstock corporations.",
  "content": [
    {
      "number": "(a)",
      "content": [
        {
          "type": "paragraph",
          "text": "After a corporation has received payment for any of its capital stock, or after a nonstock corporation has members, it may amend its certificate of incorporation, from time to time, in any and as many respects as may be desired, so long as its certificate of incorporation as amended would contain only such provisions as it would be lawful and proper to insert in an original certificate of incorporation filed at the time of the filing of the amendment; and, if a change in stock or the rights of stockholders, or an exchange, reclassification, subdivision, combination or cancellation of stock or rights of stockholders is to be made, such provisions as may be necessary to effect such change, exchange, reclassification, subdivision, combination or cancellation. In particular, and without limitation upon such general power of amendment, a corporation may amend its certificate of incorporation, from time to time, so as:"
        },
        {
          "number": "(1)",
          "content": "To change its corporate name; or"
        },
        {
          "number": "(2)",
          "content": "To change, substitute, enlarge or diminish the nature of its business or its corporate powers and purposes; or"
        },
        {
          "number": "(3)",
          "content": "To increase or decrease its authorized capital stock or to reclassify the same, by changing the number, par value, designations, preferences, or relative, participating, optional, or other special rights of the shares, or the qualifications, limitations or restrictions of such rights, or by changing shares with par value into shares without par value, or shares without par value into shares with par value either with or without increasing or decreasing the number of shares, or by subdividing or combining the outstanding shares of any class or series of a class of shares into a greater or lesser number of outstanding shares; or"
        },
        {
          "number": "(4)",
          "content": "To cancel or otherwise affect the right of the holders of the shares of any class to receive dividends which have accrued but have not been declared; or"
        },
        {
          "number": "(5)",
          "content": "To create new classes of stock having rights and preferences either prior and superior or subordinate and inferior to the stock of any class then authorized, whether issued or unissued; or"
        },
        {
          "number": "(6)",
          "content": "To change the period of its duration; or"
        },
        {
          "number": "(7)",
          "content": [
            {
              "type": "paragraph",
              "text": "To delete:"
            },
            {
              "number": "a.",
              "content": "Such provisions of the original certificate of incorporation which named the incorporator or incorporators, the initial board of directors and the original subscribers for shares; and"
            },
            {
              "number": "b.",
              "content": "Such provisions contained in any amendment to the certificate of incorporation as were necessary to effect a change, exchange, reclassification, subdivision, combination or cancellation of stock, if such change, exchange, reclassification, subdivision, combination or cancellation has become effective."
            },
            {
              "type": "paragraph",
              "text": "Any or all such changes or alterations may be effected by 1 certificate of amendment."
            }
          ]
        }
      ]
    },
    {
      "number": "(b)",
      "content": [
        {
          "type": "paragraph",
          "text": "Every amendment authorized by subsection (a) of this section shall be made and effected in the following manner:"
        },
        {
          "number": "(1)",
          "content": "If the corporation has capital stock, its board of directors shall adopt a resolution setting forth the amendment proposed, declaring its advisability, and either calling a special meeting of the stockholders entitled to vote in respect thereof for the consideration of such amendment or directing that the amendment proposed be considered at the next annual meeting of the stockholders; provided, however, that unless otherwise expressly required by the certificate of incorporation, no meeting or vote of stockholders shall be required to adopt an amendment that effects only changes described in paragraph (a)(1) or (7) of this section. Such special or annual meeting shall be called and held upon notice in accordance with § 222 of this title. The notice shall set forth such amendment in full or a brief summary of the changes to be effected thereby unless such notice constitutes a notice of internet availability of proxy materials under the rules promulgated under the Securities Exchange Act of 1934 [15 U.S.C. § 78a et seq.]. At the meeting a vote of the stockholders entitled to vote thereon shall be taken for and against any proposed amendment that requires adoption by stockholders. If no vote of stockholders is required to effect such amendment, or if a majority of the outstanding stock entitled to vote thereon, and a majority of the outstanding stock of each class entitled to vote thereon as a class has been voted in favor of the amendment, a certificate setting forth the amendment and certifying that such amendment has been duly adopted in accordance with this section shall be executed, acknowledged and filed and shall become effective in accordance with § 103 of this title."
        },
        {
          "number": "(2)",
          "content": "The holders of the outstanding shares of a class shall be entitled to vote as a class upon a proposed amendment, whether or not entitled to vote thereon by the certificate of incorporation, if the amendment would increase or decrease the aggregate number of authorized shares of such class, increase or decrease the par value of the shares of such class, or alter or change the powers, preferences, or special rights of the shares of such class so as to affect them adversely. If any proposed amendment would alter or change the powers, preferences, or special rights of 1 or more series of any class so as to affect them adversely, but shall not so affect the entire class, then only the shares of the series so affected by the amendment shall be considered a separate class for the purposes of this paragraph. The number of authorized shares of any such class or classes of stock may be increased or decreased (but not below the number of shares thereof then outstanding) by the affirmative vote of the holders of a majority of the stock of the corporation entitled to vote irrespective of this subsection, if so provided in the original certificate of incorporation, in any amendment thereto which created such class or classes of stock or which was adopted prior to the issuance of any shares of such class or classes of stock, or in any amendment thereto which was authorized by a resolution or resolutions adopted by the affirmative vote of the holders of a majority of such class or classes of stock."
        },
        {
          "number": "(3)",
          "content": "If the corporation is a nonstock corporation, then the governing body thereof shall adopt a resolution setting forth the amendment proposed and declaring its advisability. If a majority of all the members of the governing body shall vote in favor of such amendment, a certificate thereof shall be executed, acknowledged and filed and shall become effective in accordance with § 103 of this title. The certificate of incorporation of any nonstock corporation may contain a provision requiring any amendment thereto to be approved by a specified number or percentage of the members or of any specified class of members of such corporation in which event such proposed amendment shall be submitted to the members or to any specified class of members of such corporation in the same manner, so far as applicable, as is provided in this section for an amendment to the certificate of incorporation of a stock corporation; and in the event of the adoption thereof by such members, a certificate evidencing such amendment shall be executed, acknowledged and filed and shall become effective in accordance with § 103 of this title."
        },
        {
          "number": "(4)",
          "content": "Whenever the certificate of incorporation shall require for action by the board of directors of a corporation other than a nonstock corporation or by the governing body of a nonstock corporation, by the holders of any class or series of shares or by the members, or by the holders of any other securities having voting power the vote of a greater number or proportion than is required by any section of this title, the provision of the certificate of incorporation requiring such greater vote shall not be altered, amended or repealed except by such greater vote."
        }
      ]
    },
    {
      "number": "(c)",
      "content": "The resolution authorizing a proposed amendment to the certificate of incorporation may provide that at any time prior to the effectiveness of the filing of the amendment with the Secretary of State, notwithstanding authorization of the proposed amendment by the stockholders of the corporation or by the members of a nonstock corporation, the board of directors or governing body may abandon such proposed amendment without further action by the stockholders or members."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 242",
    "56 Del. Laws, c. 50",
    "57 Del. Laws, c. 148, §§ 18-21",
    "59 Del. Laws, c. 106, § 7",
    "63 Del. Laws, c. 25, § 12",
    "64 Del. Laws, c. 112, § 24",
    "67 Del. Laws, c. 376, § 10",
    "70 Del. Laws, c. 349, §§ 5-7",
    "70 Del. Laws, c. 587, § 14, 15",
    "72 Del. Laws, c. 123, § 5",
    "77 Del. Laws, c. 253, §§ 33-35",
    "77 Del. Laws, c. 290, § 7",
    "79 Del. Laws, c. 327, § 6.;"
  ]
}
