{
  "jurisdiction": "US-DE",
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "VIII"
    },
    {
      "subdivision": "section",
      "number": "243"
    }
  ],
  "heading": "Retirement of stock",
  "content": [
    {
      "number": "(a)",
      "content": "A corporation, by resolution of its board of directors, may retire any shares of its capital stock that are issued but are not outstanding."
    },
    {
      "number": "(b)",
      "content": "Whenever any shares of the capital stock of a corporation are retired, they shall resume the status of authorized and unissued shares of the class or series to which they belong unless the certificate of incorporation otherwise provides. If the certificate of incorporation prohibits the reissuance of such shares, or prohibits the reissuance of such shares as a part of a specific series only, a certificate stating that reissuance of the shares (as part of the class or series) is prohibited identifying the shares and reciting their retirement shall be executed, acknowledged and filed and shall become effective in accordance with § 103 of this title. When such certificate becomes effective, it shall have the effect of amending the certificate of incorporation so as to reduce accordingly the number of authorized shares of the class or series to which such shares belong or, if such retired shares constitute all of the authorized shares of the class or series to which they belong, of eliminating from the certificate of incorporation all reference to such class or series of stock."
    },
    {
      "number": "(c)",
      "content": "If the capital of the corporation will be reduced by or in connection with the retirement of shares, the reduction of capital shall be effected pursuant to § 244 of this title."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 243",
    "56 Del. Laws, c. 50",
    "57 Del. Laws, c. 149",
    "57 Del. Laws, c. 421, § 7",
    "59 Del. Laws, c. 106, § 8",
    "66 Del. Laws, c. 136, §§ 15, 16"
  ]
}
