{
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "X"
    },
    {
      "subdivision": "section",
      "number": "274"
    }
  ],
  "heading": "Dissolution before issuance of shares or beginning of business; procedure.",
  "content": [
    {
      "type": "paragraph",
      "text": "If a corporation has not issued shares or has not commenced the business for which the corporation was organized, a majority of the incorporators, or, if directors were named in the certificate of incorporation or have been elected, a majority of the directors, may surrender all of the corporation's rights and franchises by filing in the office of the Secretary of State a certificate, executed and acknowledged by a majority of the incorporators or directors, stating: that no shares of stock have been issued or that the business or activity for which the corporation was organized has not been begun; the date of filing of the corporation's original certificate of incorporation with the Secretary of State; that no part of the capital of the corporation has been paid, or, if some capital has been paid, that the amount actually paid in for the corporation's shares, less any part thereof disbursed for necessary expenses, has been returned to those entitled thereto; that if the corporation has begun business but it has not issued shares, all debts of the corporation have been paid; that if the corporation has not begun business but has issued stock certificates, all issued stock certificates, if any, have been surrendered and cancelled; and that all rights and franchises of the corporation are surrendered. Upon such certificate becoming effective in accordance with § 103 of this title, the corporation shall be dissolved."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 274",
    "56 Del. Laws, c. 50",
    "59 Del. Laws, c. 106, § 13",
    "66 Del. Laws, c. 136, § 33",
    "77 Del. Laws, c. 290, § 24"
  ]
}
