{
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "X"
    },
    {
      "subdivision": "section",
      "number": "275"
    }
  ],
  "heading": "Dissolution generally; procedure.",
  "content": [
    {
      "number": "(a)",
      "content": "If it should be deemed advisable in the judgment of the board of directors of any corporation that it should be dissolved, the board, after the adoption of a resolution to that effect by a majority of the whole board at any meeting called for that purpose, shall cause notice of the adoption of the resolution and of a meeting of stockholders to take action upon the resolution to be mailed to each stockholder entitled to vote thereon as of the record date for determining the stockholders entitled to notice of the meeting."
    },
    {
      "number": "(b)",
      "content": "At the meeting a vote shall be taken upon the proposed dissolution. If a majority of the outstanding stock of the corporation entitled to vote thereon shall vote for the proposed dissolution, a certification of dissolution shall be filed with the Secretary of State pursuant to subsection (d) of this section."
    },
    {
      "number": "(c)",
      "content": "Dissolution of a corporation may also be authorized without action of the directors if all the stockholders entitled to vote thereon shall consent in writing and a certificate of dissolution shall be filed with the Secretary of State pursuant to subsection (d) of this section."
    },
    {
      "number": "(d)",
      "content": [
        {
          "type": "paragraph",
          "text": "If dissolution is authorized in accordance with this section, a certificate of dissolution shall be executed, acknowledged and filed, and shall become effective, in accordance with § 103 of this title. Such certificate of dissolution shall set forth:"
        },
        {
          "number": "(1)",
          "content": "The name of the corporation;"
        },
        {
          "number": "(2)",
          "content": "The date dissolution was authorized;"
        },
        {
          "number": "(3)",
          "content": "That the dissolution has been authorized by the board of directors and stockholders of the corporation, in accordance with subsections (a) and (b) of this section, or that the dissolution has been authorized by all of the stockholders of the corporation entitled to vote on a dissolution, in accordance with subsection (c) of this section;"
        },
        {
          "number": "(4)",
          "content": "The names and addresses of the directors and officers of the corporation; and"
        },
        {
          "number": "(5)",
          "content": "The date of filing of the corporation’s original certificate of incorporation with the Secretary of State."
        }
      ]
    },
    {
      "number": "(e)",
      "content": "The resolution authorizing a proposed dissolution may provide that notwithstanding authorization or consent to the proposed dissolution by the stockholders, or the members of a nonstock corporation pursuant to § 276 of this title, the board of directors or governing body may abandon such proposed dissolution without further action by the stockholders or members."
    },
    {
      "number": "(f)",
      "content": "Upon a certificate of dissolution becoming effective in accordance with § 103 of this title, the corporation shall be dissolved."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 275",
    "56 Del. Laws, c. 50",
    "57 Del. Laws, c. 148, §§ 31, 32",
    "59 Del. Laws, c. 106, § 14",
    "66 Del. Laws, c. 136, § 34",
    "77 Del. Laws, c. 14, § 14",
    "77 Del. Laws, c. 290, § 25"
  ]
}
