{
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "XVII"
    },
    {
      "subdivision": "section",
      "number": "389"
    }
  ],
  "heading": "Temporary transfer of domicile into this State.",
  "content": [
    {
      "number": "(a)",
      "content": [
        {
          "type": "paragraph",
          "text": "As used in this section:"
        },
        {
          "number": "(1)",
          "content": [
            {
              "type": "paragraph",
              "text": "The term “emergency condition” shall be deemed to include but not be limited to any of the following:"
            },
            {
              "number": "a.",
              "content": "War or other armed conflict;"
            },
            {
              "number": "b.",
              "content": "Revolution or insurrection;"
            },
            {
              "number": "c.",
              "content": "Invasion or occupation by foreign military forces;"
            },
            {
              "number": "d.",
              "content": "Rioting or civil commotion of an extended nature;"
            },
            {
              "number": "e.",
              "content": "Domination by a foreign power;"
            },
            {
              "number": "f.",
              "content": "Expropriation, nationalization or confiscation of a material part of the assets or property of the non-United States entity;"
            },
            {
              "number": "g.",
              "content": "Impairment of the institution of private property (including private property held abroad);"
            },
            {
              "number": "h.",
              "content": "The taking of any action under the laws of the United States whereby persons resident in the jurisdiction, the law of which governs the internal affairs of the non-United States entity, might be treated as “enemies” or otherwise restricted under laws of the United States relating to trading with enemies of the United States;"
            },
            {
              "number": "i.",
              "content": "The immediate threat of any of the foregoing; and"
            },
            {
              "number": "j.",
              "content": "Such other event which, under the law of the jurisdiction governing the internal affairs of the non-United States entity, permits the non-United States entity to transfer its domicile."
            }
          ]
        },
        {
          "number": "(2)",
          "content": "The term “foreign jurisdiction” and the term “non-United States entity” shall have the same meanings as set forth in § 388(a) of this title."
        },
        {
          "number": "(3)",
          "content": "The terms “officers” and “directors” include, in addition to such persons, trustees, managers, partners and all other persons performing functions equivalent to those of officers and directors, however named or described in any relevant instrument."
        }
      ]
    },
    {
      "number": "(b)",
      "content": "Any non-United States entity may, subject to and upon compliance with this section, transfer its domicile (which term, as used in this section, shall be deemed to refer in addition to the seat, siege social or principal place of business or central administration of such entity, or any other equivalent thereto under applicable law) into this State, and may perform the acts described in this section, so long as the law by which the internal affairs of such entity are governed does not expressly prohibit such transfer."
    },
    {
      "number": "(c)",
      "content": [
        {
          "type": "paragraph",
          "text": "Any non-United States entity that shall propose to transfer its domicile into this State shall submit to the Secretary of State for the Secretary of State’s review, at least 30 days prior to the proposed transfer of domicile, the following:"
        },
        {
          "number": "(1)",
          "content": "A copy of its certificate of incorporation and bylaws (or the equivalent thereof under applicable law), certified as true and correct by the appropriate director, officer or government official;"
        },
        {
          "number": "(2)",
          "content": "A certificate issued by an authorized official of the jurisdiction the law of which governs the internal affairs of the non-United States entity evidencing its existence;"
        },
        {
          "number": "(3)",
          "content": "A list indicating the person or persons who, in the event of a transfer pursuant to this section, shall be the authorized officers and directors of the non-United States entity, together with evidence of their authority to act and their respective executed agreements in writing regarding service of process as set out in subsection (j) of this section;"
        },
        {
          "number": "(4)",
          "content": [
            {
              "type": "paragraph",
              "text": "A certificate executed by the appropriate officer or director of the non-United States entity, setting forth:"
            },
            {
              "number": "a.",
              "content": "The name and address of its registered agent in this State;"
            },
            {
              "number": "b.",
              "content": "A general description of the business in which it is engaged;"
            },
            {
              "number": "c.",
              "content": "That the filing of such certificate has been duly authorized by any necessary action and does not violate the certificate of incorporation or bylaws (or equivalent thereof under applicable law) or any material agreement or instrument binding on such entity;"
            },
            {
              "number": "d.",
              "content": "A list indicating the person or persons authorized to sign the written communications required by subsection (e) of this section;"
            },
            {
              "number": "e.",
              "content": "An affirmance that such transfer is not expressly prohibited under the law by which the internal affairs of the non-United States entity are governed; and"
            },
            {
              "number": "f.",
              "content": "An undertaking that any transfer of domicile into this State will take place only in the event of an emergency condition in the jurisdiction the law of which governs the internal affairs of the non-United States entity and that such transfer shall continue only so long as such emergency condition, in the judgment of the non-United States entity’s management, so requires; and"
            }
          ]
        },
        {
          "number": "(5)",
          "content": "The examination fee prescribed under § 391 of this title."
        },
        {
          "type": "paragraph",
          "text": "If any of the documents referred to in paragraphs (c)(1)-(5) of this section are not in English, a translation thereof, under oath of the translator, shall be attached thereto. If such documents satisfy the requirements of this section, and if the name of the non-United States entity meets the requirements of § 102(a)(1) of this title, the Secretary of State shall notify the non-United States entity that such documents have been accepted for filing, and the records of the Secretary of State shall reflect such acceptance and such notification. In addition, the Secretary of State shall enter the name of the non-United States entity on the Secretary of State’s reserved list to remain there so long as the non-United States entity is in compliance with this section. No document submitted under this subsection shall be available for public inspection pursuant to Chapter 100 of Title 29 until, and unless, such entity effects a transfer of its domicile as provided in this section. The Secretary of State may waive the 30-day period and translation requirement provided for in this subsection upon request by such entity, supported by facts (including, without limitation, the existence of an emergency condition) justifying such waiver."
        }
      ]
    },
    {
      "number": "(d)",
      "content": "On or before March 1 in each year, prior to the transfer of its domicile as provided for in subsection (e) of this section, during any such transfer and, in the event that it desires to continue to be subject to a transfer of domicile under this section, after its domicile has ceased to be in this State, the non-United States entity shall file a certificate executed by an appropriate officer or director of the non-United States entity, certifying that the documents submitted pursuant to this section remain in full force and effect or attaching any amendments or supplements thereto and translated as required in subsection (c) of this section, together with the filing fee prescribed under § 391 of this title. In the event that any non-United States entity fails to file the required certificate on or before March 1 in each year, all certificates and filings made pursuant to this section shall become null and void on March 2 in such year, and any proposed transfer thereafter shall be subject to all of the required submissions and the examination fee set forth in subsection (c) of this section."
    },
    {
      "number": "(e)",
      "content": "If the Secretary of State accepts the documents submitted pursuant to subsection (c) of this section for filing, such entity may transfer its domicile to this State at any time by means of a written communication to such effect addressed to the Secretary of State, signed by 1 of the persons named on the list filed pursuant to paragraph (c)(4)d. of this section, and confirming that the statements made pursuant to paragraph (c)(4) of this section remain true and correct; provided, that if emergency conditions have affected ordinary means of communication, such notification may be made by telegram, telex, telecopy or other form of writing so long as a duly signed duplicate is received by the Secretary of State within 30 days thereafter. The records of the Secretary of State shall reflect the fact of such transfer. Upon the payment to the Secretary of State of the fee prescribed under § 391 of this title, the Secretary of State shall certify that the non-United States entity has filed all documents and paid all fees required by this title. Such certificate of the Secretary of State shall be prima facie evidence of transfer by such non-United States entity of its domicile into this State."
    },
    {
      "number": "(f)",
      "content": "Except to the extent expressly prohibited by the laws of this State, from and after the time that a non-United States entity transfers its domicile to this State pursuant to this section, the non-United States entity shall have all of the powers which it had immediately prior to such transfer under the law of the jurisdiction governing its internal affairs and the directors and officers designated pursuant to paragraph (c)(3) of this section, and their successors, may manage the business and affairs of the non-United States entity in accordance with the laws of such jurisdiction. Any such activity conducted pursuant to this section shall not be deemed to be doing business within this State for purposes of § 371 of this title. Any reference in this section to the law of the jurisdiction governing the internal affairs of a non-United States entity which has transferred its domicile into this State shall be deemed to be a reference to such law as in effect immediately prior to the transfer of domicile."
    },
    {
      "number": "(g)",
      "content": "For purposes of any action in the courts of this State, no non-United States entity which has obtained the certificate of the Secretary of State referred to in subsection (e) of this section shall be deemed to be an “enemy” person or entity for any purpose, including, without limitation, in relation to any claim of title to its assets, wherever located, or to its ability to institute suit in said courts."
    },
    {
      "number": "(h)",
      "content": "The transfer by any non-United States entity of its domicile into this State shall not be deemed to affect any obligations or liabilities of such non-United States entity incurred prior to such transfer."
    },
    {
      "number": "(i)",
      "content": "The directors of any non-United States entity which has transferred its domicile into this State may withhold from any holder of equity interests in such entity any amounts payable to such holder on account of dividends or other distributions, if the directors shall determine that such holder will not have the full benefit of such payment, so long as the directors shall make provision for the retention of such withheld payment in escrow or under some similar arrangement for the benefit of such holder."
    },
    {
      "number": "(j)",
      "content": "All process issued out of any court of this State, all orders made by any court of this State and all rules and notices of any kind required to be served on any non-United States entity which has transferred its domicile into this State may be served on the non-United States entity pursuant to § 321 of this title in the same manner as if such entity were a corporation of this State. The directors of a non-United States entity which has transferred its domicile into this State shall agree in writing that they will be amenable to service of process by the same means as, and subject to the jurisdiction of the courts of this State to the same extent as are directors of corporations of this State, and such agreements shall be submitted to the Secretary of State for filing before the respective directors take office."
    },
    {
      "number": "(k)",
      "content": "Any non-United States entity which has transferred its domicile into this State may voluntarily return to the jurisdiction the law of which governs its internal affairs by filing with the Secretary of State an application to withdraw from this State. Such application shall be accompanied by a resolution of the directors of the non-United States entity authorizing such withdrawal and by a certificate of the highest diplomatic or consular official of such jurisdiction accredited to the United States indicating the consent of such jurisdiction to such withdrawal. The application shall also contain, or be accompanied by, the agreement of the non-United States entity that it may be served with process in this State in any proceeding for enforcement of any obligation of the non-United States entity arising prior to its withdrawal from this State, which agreement shall include the appointment of the Secretary of State as the agent of the non-United States entity to accept service of process in any such proceeding and shall specify the address to which a copy of process served upon the Secretary of State shall be mailed. Upon the payment of any fees and taxes owed to this State, the Secretary of State shall file the application and the non-United States entity’s domicile shall, as of the time of filing, cease to be in this State."
    }
  ],
  "history": [
    "64 Del. Laws, c. 321, § 3",
    "71 Del. Laws, c. 339, § 88",
    "75 Del. Laws, c. 30, §§ 46-66",
    "79 Del. Laws, c. 122, § 10"
  ]
}
