{
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "XVII"
    },
    {
      "subdivision": "section",
      "number": "390"
    }
  ],
  "heading": "Transfer, domestication or continuance of domestic corporations",
  "content": [
    {
      "number": "(a)",
      "content": [
        {
          "type": "paragraph",
          "text": "Upon compliance with the provisions of this section, any corporation existing under the laws of this State may transfer to or domesticate or continue in any foreign jurisdiction and, in connection therewith, may elect to continue its existence as a corporation of this State. As used in this section, the term:"
        },
        {
          "number": "(1)",
          "content": "“Foreign jurisdiction” means any foreign country, or other foreign jurisdiction (other than the United States, any state, the District of Columbia, or any possession or territory of the United States); and"
        },
        {
          "number": "(2)",
          "content": "“Resulting entity” means the entity formed, incorporated, created or otherwise coming into being as a consequence of the transfer of the corporation to, or its domestication or continuance in, a foreign jurisdiction pursuant to this section."
        }
      ]
    },
    {
      "number": "(b)",
      "content": [
        {
          "type": "paragraph",
          "text": "The board of directors of the corporation which desires to transfer to or domesticate or continue in a foreign jurisdiction shall adopt a resolution approving such transfer, domestication or continuance specifying the foreign jurisdiction to which the corporation shall be transferred or in which the corporation shall be domesticated or continued and, if applicable, that in connection with such transfer, domestication or continuance the corporation’s existence as a corporation of this State is to continue and recommending the approval of such transfer or domestication or continuance by the stockholders of the corporation. Such resolution shall be submitted to the stockholders of the corporation at an annual or special meeting. Due notice of the time, place and purpose of the meeting shall be mailed to each holder of stock, whether voting or nonvoting, of the corporation at the address of the stockholder as it appears on the records of the corporation, at least 20 days prior to the date of the meeting. At the meeting, the resolution shall be considered and a vote taken for its adoption or rejection. If all outstanding shares of stock of the corporation, whether voting or nonvoting, shall be voted for the adoption of the resolution, the corporation shall file with the Secretary of State a certificate of transfer if its existence as a corporation of this State is to cease or a certificate of transfer and domestic continuance if its existence as a corporation of this State is to continue, executed in accordance with § 103 of this title, which certifies:"
        },
        {
          "number": "(1)",
          "content": "The name of the corporation, and if it has been changed, the name under which it was originally incorporated."
        },
        {
          "number": "(2)",
          "content": "The date of filing of its original certificate of incorporation with the Secretary of State."
        },
        {
          "number": "(3)",
          "content": "The foreign jurisdiction to which the corporation shall be transferred or in which it shall be domesticated or continued and the name of the resulting entity."
        },
        {
          "number": "(4)",
          "content": "That the transfer, domestication or continuance of the corporation has been approved in accordance with the provisions of this section."
        },
        {
          "number": "(5)",
          "content": [
            {
              "type": "paragraph",
              "text": "In the case of a certificate of transfer,"
            },
            {
              "number": "(i)",
              "content": "that the existence of the corporation as a corporation of this State shall cease when the certificate of transfer becomes effective, and"
            },
            {
              "number": "(ii)",
              "content": "the agreement of the corporation that it may be served with process in this State in any proceeding for enforcement of any obligation of the corporation arising while it was a corporation of this State which shall also irrevocably appoint the Secretary of State as its agent to accept service of process in any such proceeding and specify the address (which may not be that of the corporation’s registered agent without the written consent of the corporation’s registered agent, such consent to be filed along with the certificate of transfer) to which a copy of such process shall be mailed by the Secretary of State."
            },
            {
              "type": "paragraph",
              "text": "Process may be served upon the Secretary of State under this subsection by means of electronic transmission but only as prescribed by the Secretary of State. The Secretary of State is authorized to issue such rules and regulations with respect to such service as the Secretary of State deems necessary or appropriate. In the event of service upon the Secretary of State in accordance with this subsection, the Secretary of State shall forthwith notify such corporation that has transferred out of the State of Delaware by letter, directed to such corporation that has transferred out of the State of Delaware at the address so specified, unless such corporation shall have designated in writing to the Secretary of State a different address for such purpose, in which case it shall be mailed to the last address designated. Such letter shall be sent by a mail or courier service that includes a record of mailing or deposit with the courier and a record of delivery evidenced by the signature of the recipient. Such letter shall enclose a copy of the process and any other papers served on the Secretary of State pursuant to this subsection. It shall be the duty of the plaintiff in the event of such service to serve process and any other papers in duplicate, to notify the Secretary of State that service is being effected pursuant to this subsection and to pay the Secretary of State the sum of $50 for the use of the State, which sum shall be taxed as part of the costs in the proceeding, if the plaintiff shall prevail therein. The Secretary of State shall maintain an alphabetical record of any such service setting forth the name of the plaintiff and the defendant, the title, docket number and nature of the proceeding in which process has been served, the fact that service has been effected pursuant to this subsection, the return date thereof, and the day and hour service was made. The Secretary of State shall not be required to retain such information longer than 5 years from receipt of the service of process."
            }
          ]
        },
        {
          "number": "(6)",
          "content": "In the case of a certificate of transfer and domestic continuance, that the corporation will continue to exist as a corporation of this State after the certificate of transfer and domestic continuance becomes effective."
        }
      ]
    },
    {
      "number": "(c)",
      "content": "Upon the filing of a certificate of transfer in accordance with subsection (b) of this section and payment to the Secretary of State of all fees prescribed under this title, the Secretary of State shall certify that the corporation has filed all documents and paid all fees required by this title, and thereupon the corporation shall cease to exist as a corporation of this State at the time the certificate of transfer becomes effective in accordance with § 103 of this title. Such certificate of the Secretary of State shall be prima facie evidence of the transfer, domestication or continuance by such corporation out of this State."
    },
    {
      "number": "(d)",
      "content": "The transfer, domestication or continuance of a corporation out of this State in accordance with this section and the resulting cessation of its existence as a corporation of this State pursuant to a certificate of transfer shall not be deemed to affect any obligations or liabilities of the corporation incurred prior to such transfer, domestication or continuance, the personal liability of any person incurred prior to such transfer, domestication or continuance, or the choice of law applicable to the corporation with respect to matters arising prior to such transfer, domestication or continuance. Unless otherwise agreed or otherwise provided in the certificate of incorporation, the transfer, domestication or continuance of a corporation out of the State of Delaware in accordance with this section shall not require such corporation to wind up its affairs or pay its liabilities and distribute its assets under this title and shall not be deemed to constitute a dissolution of such corporation."
    },
    {
      "number": "(e)",
      "content": "If a corporation files a certificate of transfer and domestic continuance, after the time the certificate of transfer and domestic continuance becomes effective, the corporation shall continue to exist as a corporation of this State, and the law of the State of Delaware, including this title, shall apply to the corporation to the same extent as prior to such time. So long as a corporation continues to exist as a corporation of the State of Delaware following the filing of a certificate of transfer and domestic continuance, the continuing corporation and the resulting entity shall, for all purposes of the laws of the State of Delaware, constitute a single entity formed, incorporated, created or otherwise having come into being, as applicable, and existing under the laws of the State of Delaware and the laws of the foreign jurisdiction."
    },
    {
      "number": "(f)",
      "content": "When a corporation has transferred, domesticated or continued pursuant to this section, for all purposes of the laws of the State of Delaware, the resulting entity shall be deemed to be the same entity as the transferring, domesticating or continuing corporation and shall constitute a continuation of the existence of such corporation in the form of the resulting entity. When any transfer, domestication or continuance shall have become effective under this section, for all purposes of the laws of the State of Delaware, all of the rights, privileges and powers of the corporation that has transferred, domesticated or continued, and all property, real, personal and mixed, and all debts due to such corporation, as well as all other things and causes of action belonging to such corporation, shall remain vested in the resulting entity (and also in the corporation that has transferred, domesticated or continued, if and for so long as such corporation continues its existence as a corporation of this State) and shall be the property of such resulting entity (and also of the corporation that has transferred, domesticated or continued, if and for so long as such corporation continues its existence as a corporation of this State), and the title to any real property vested by deed or otherwise in such corporation shall not revert or be in any way impaired by reason of this title; but all rights of creditors and all liens upon any property of such corporation shall be preserved unimpaired, and all debts, liabilities and duties of such corporation shall remain attached to the resulting entity (and also to the corporation that has transferred, domesticated or continued, if and for so long as such corporation continues its existence as a corporation of this State), and may be enforced against it to the same extent as if said debts, liabilities and duties had originally been incurred or contracted by it in its capacity as such resulting entity. The rights, privileges, powers and interests in property of the corporation, as well as the debts, liabilities and duties of the corporation, shall not be deemed, as a consequence of the transfer, domestication or continuance, to have been transferred to the resulting entity for any purpose of the laws of the State of Delaware."
    },
    {
      "number": "(g)",
      "content": "In connection with a transfer, domestication or continuance under this section, shares of stock of the transferring, domesticating or continuing corporation may be exchanged for or converted into cash, property, or shares of stock, rights or securities of, or interests in, the resulting entity or, in addition to or in lieu thereof, may be exchanged for or converted into cash, property, or shares of stock, rights or securities of, or interests in, another corporation or other entity or may be cancelled."
    },
    {
      "number": "(h)",
      "content": "No vote of the stockholders of a corporation shall be necessary to authorize a transfer, domestication or continuance if no shares of the stock of such corporation shall have been issued prior to the adoption by the board of directors of the resolution approving the transfer, domestication or continuance."
    },
    {
      "number": "(i)",
      "content": "Whenever it shall be desired to transfer to or domesticate or continue in any foreign jurisdiction any nonstock corporation, the governing body shall perform all the acts necessary to effect a transfer, domestication or continuance which are required by this section to be performed by the board of directors of a corporation having capital stock. If the members of a nonstock corporation are entitled to vote for the election of members of its governing body or are entitled under the certificate of incorporation or the bylaws of such corporation to vote on such transfer, domestication or continuance or on a merger, consolidation, or dissolution of the corporation, they, and any other holder of any membership interest in the corporation, shall perform all the acts necessary to effect a transfer, domestication or continuance which are required by this section to be performed by the stockholders of a corporation having capital stock. If there is no member entitled to vote thereon, nor any other holder of any membership interest in the corporation, the transfer, domestication or continuance of the corporation shall be authorized at a meeting of the governing body, upon the adoption of a resolution to transfer or domesticate or continue by the vote of a majority of members of its governing body then in office. In all other respects, the method and proceedings for the transfer, domestication or continuance of a nonstock corporation shall conform as nearly as may be to the proceedings prescribed by this section for the transfer, domestication or continuance of corporations having capital stock. In the case of a charitable nonstock corporation, due notice of the corporation’s intent to effect a transfer, domestication or continuance shall be mailed to the Attorney General of the State of Delaware 10 days prior to the date of the proposed transfer, domestication or continuance."
    }
  ],
  "history": [
    "70 Del. Laws, c. 79, § 20",
    "71 Del. Laws, c. 120, §§ 20-29",
    "75 Del. Laws, c. 30, §§ 67-79",
    "77 Del. Laws, c. 253, § 66",
    "77 Del. Laws, c. 290, § 35",
    "78 Del. Laws, c. 273, § 11",
    "79 Del. Laws, c. 122, § 10"
  ]
}
