{
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "V"
    },
    {
      "subdivision": "section",
      "number": "154"
    }
  ],
  "heading": "Determination of amount of capital; capital, surplus and net assets defined",
  "content": [
    {
      "type": "paragraph",
      "text": "Any corporation may, by resolution of its board of directors, determine that only a part of the consideration which shall be received by the corporation for any of the shares of its capital stock which it shall issue from time to time shall be capital; but, in case any of the shares issued shall be shares having a par value, the amount of the part of such consideration so determined to be capital shall be in excess of the aggregate par value of the shares issued for such consideration having a par value, unless all the shares issued shall be shares having a par value, in which case the amount of the part of such consideration so determined to be capital need be only equal to the aggregate par value of such shares. In each such case the board of directors shall specify in dollars the part of such consideration which shall be capital. If the board of directors shall not have determined"
    },
    {
      "number": "(1)",
      "content": "at the time of issue of any shares of the capital stock of the corporation issued for cash or"
    },
    {
      "number": "(2)",
      "content": "within 60 days after the issue of any shares of the capital stock of the corporation issued for consideration other than cash what part of the consideration for such shares shall be capital,"
    },
    {
      "type": "paragraph",
      "text": "the capital of the corporation in respect of such shares shall be an amount equal to the aggregate par value of such shares having a par value, plus the amount of the consideration for such shares without par value. The amount of the consideration so determined to be capital in respect of any shares without par value shall be the stated capital of such shares. The capital of the corporation may be increased from time to time by resolution of the board of directors directing that a portion of the net assets of the corporation in excess of the amount so determined to be capital be transferred to the capital account. The board of directors may direct that the portion of such net assets so transferred shall be treated as capital in respect of any shares of the corporation of any designated class or classes. The excess, if any, at any given time, of the net assets of the corporation over the amount so determined to be capital shall be surplus. Net assets means the amount by which total assets exceed total liabilities. Capital and surplus are not liabilities for this purpose. Notwithstanding anything in this section to the contrary, for purposes of this section and §§ 160 and 170 of this title, the capital of any nonstock corporation shall be deemed to be zero."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 154",
    "56 Del. Laws, c. 50",
    "59 Del. Laws, c. 106, § 2",
    "74 Del. Laws, c. 326, § 4",
    "77 Del. Laws, c. 253, § 15"
  ]
}
