{
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "XVI"
    },
    {
      "subdivision": "section",
      "number": "371"
    }
  ],
  "heading": "Definition; qualification to do business in State; procedure",
  "content": [
    {
      "number": "(a)",
      "content": "As used in this chapter, the words “foreign corporation” mean a corporation organized under the laws of any jurisdiction other than this State."
    },
    {
      "number": "(b)",
      "content": [
        {
          "type": "paragraph",
          "text": "No foreign corporation shall do any business in this State, through or by branch offices, agents or representatives located in this State, until it shall have paid to the Secretary of State of this State for the use of this State, $80, and shall have filed in the office of the Secretary of State:"
        },
        {
          "number": "(1)",
          "content": "A certificate, as of a date not earlier than 6 months prior to the filing date, issued by an authorized officer of the jurisdiction of its incorporation evidencing its corporate existence. If such certificate is in a foreign language, a translation thereof, under oath of the translator, shall be attached thereto;"
        },
        {
          "number": "(2)",
          "content": [
            {
              "type": "paragraph",
              "text": "A statement executed by an authorized officer of each corporation setting forth"
            },
            {
              "number": "(i)",
              "content": "the name and address of its registered agent in this State, which agent may be any of the foreign corporation itself, an individual resident in this State, a domestic corporation, a domestic partnership (whether general (including a limited liability partnership) or limited (including a limited liability limited partnership)), a domestic limited liability company, a domestic statutory trust, a foreign corporation (other than the foreign corporation itself), a foreign partnership (whether general (including a limited liability partnership) or limited (including a limited liability limited partnership)), a foreign limited liability company or a foreign statutory trust,"
            },
            {
              "number": "(ii)",
              "content": "a statement, as of a date not earlier than 6 months prior to the filing date, of the assets and liabilities of the corporation, and"
            },
            {
              "number": "(iii)",
              "content": "the business it proposes to do in this State, and a statement that it is authorized to do that business in the jurisdiction of its incorporation."
            },
            {
              "type": "paragraph",
              "text": "The statement shall be acknowledged in accordance with § 103 of this title."
            }
          ]
        }
      ]
    },
    {
      "number": "(c)",
      "content": "The certificate of the Secretary of State, under seal of office, of the filing of the certificates required by subsection (b) of this section, shall be delivered to the registered agent upon the payment to the Secretary of State of the fee prescribed for such certificates, and the certificate shall be prima facie evidence of the right of the corporation to do business in this State; provided, that the Secretary of State shall not issue such certificate unless the name of the corporation is such as to distinguish it upon the records in the office of the Division of Corporations in the Department of State from the names that are reserved on such records and from the names on such records of each other corporation, partnership, limited partnership, limited liability company or statutory trust organized or registered as a domestic or foreign corporation, partnership, limited partnership, limited liability company or statutory trust under the laws of this State, except with the written consent of the person who has reserved such name or such other corporation, partnership, limited partnership, limited liability company or statutory trust, executed, acknowledged and filed with the Secretary of State in accordance with § 103 of this title. If the name of the foreign corporation conflicts with the name of a corporation, partnership, limited partnership, limited liability company or statutory trust organized under the laws of this State, or a name reserved for a corporation, partnership, limited partnership, limited liability company or statutory trust to be organized under the laws of this State, or a name reserved or registered as that of a foreign corporation, partnership, limited partnership, limited liability company or statutory trust under the laws of this State, the foreign corporation may qualify to do business if it adopts an assumed name which shall be used when doing business in this State as long as the assumed name is authorized for use by this section."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 371",
    "56 Del. Laws, c. 50",
    "57 Del. Laws, c. 148, § 35",
    "57 Del. Laws, c. 150, § 9",
    "57 Del. Laws, c. 421, §§ 11, 12",
    "60 Del. Laws, c. 371, § 14",
    "66 Del. Laws, c. 352, § 12",
    "67 Del. Laws, c. 229, § 1",
    "69 Del. Laws, c. 234, § 1",
    "70 Del. Laws, c. 186, § 1",
    "73 Del. Laws, c. 329, § 47",
    "75 Del. Laws, c. 306, § 6",
    "77 Del. Laws, c. 290, §§ 28, 29",
    "79 Del. Laws, c. 122, § 9"
  ]
}
