{
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "XVI"
    },
    {
      "subdivision": "section",
      "number": "373"
    }
  ],
  "heading": "Exceptions to requirements",
  "content": [
    {
      "number": "(a)",
      "content": [
        {
          "type": "paragraph",
          "text": "No foreign corporation shall be required to comply with §§ 371 and 372 of this title, under any of the following conditions:"
        },
        {
          "number": "(1)",
          "content": "If it is in the mail order or a similar business, merely receiving orders by mail or otherwise in pursuance of letters, circulars, catalogs or other forms of advertising, or solicitation, accepting the orders outside this State, and filling them with goods shipped into this State;"
        },
        {
          "number": "(2)",
          "content": "If it employs salespersons, either resident or traveling, to solicit orders in this State, either by display of samples or otherwise (whether or not maintaining sales offices in this State), all orders being subject to approval at the offices of the corporation without this State, and all goods applicable to the orders being shipped in pursuance thereof from without this State to the vendee or to the seller or such seller’s agent for delivery to the vendee, and if any samples kept within this State are for display or advertising purposes only, and no sales, repairs or replacements are made from stock on hand in this State;"
        },
        {
          "number": "(3)",
          "content": "If it sells, by contract consummated outside this State, and agrees, by the contract, to deliver into this State, machinery, plants or equipment, the construction, erection or installation of which within this State requires the supervision of technical engineers or skilled employees performing services not generally available, and as a part of the contract of sale agrees to furnish such services, and such services only, to the vendee at the time of construction, erection or installation;"
        },
        {
          "number": "(4)",
          "content": "If its business operations within this State, although not falling within the terms of paragraphs (a)(1), (2) and (3) of this section or any of them, are nevertheless wholly interstate in character;"
        },
        {
          "number": "(5)",
          "content": "If it is an insurance company doing business in this State;"
        },
        {
          "number": "(6)",
          "content": "If it creates, as borrower or lender, or acquires, evidences of debt, mortgages or liens on real or personal property;"
        },
        {
          "number": "(7)",
          "content": "If it secures or collects debts or enforces any rights in property securing the same."
        }
      ]
    },
    {
      "number": "(b)",
      "content": "This section shall have no application to the question of whether any foreign corporation is subject to service of process and suit in this State under § 382 of this title or any other law of this State."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 373",
    "56 Del. Laws, c. 50",
    "59 Del. Laws, c. 438, § 1",
    "71 Del. Laws, c. 339, § 79",
    "79 Del. Laws, c. 122, § 9"
  ]
}
