{
  "jurisdiction": "US-DE",
  "provision": [
    {
      "subdivision": "code",
      "number": "Delaware Code"
    },
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "XVI"
    },
    {
      "subdivision": "section",
      "number": "374"
    }
  ],
  "heading": "Annual report",
  "content": [
    {
      "type": "paragraph",
      "text": "On or before June 30 in each year, a foreign corporation doing business in this State shall file a report with the Secretary of State. The report shall be made on behalf of the corporation by its president, secretary, treasurer or other officer duly authorized so to act, or by any 2 of its directors, or by any incorporator in the event its board of directors shall not have been elected. The fact that an individual’s name is signed on a certification attached to a corporate report shall be prima facie evidence that such individual is authorized to certify the report on behalf of the corporation; however the official title or position of the individual signing the corporate report shall be designated. The report shall be on a calendar year basis and shall state the address (in accordance with § 131(c) of this title) of its registered office in this State; the name of its registered agent at such address upon whom service of process against the corporation may be served; the address (which shall include the street, number, city, state or foreign country) of the main or headquarters place of business of the corporation without this State; the names and addresses of all the directors and officers of the corporation and when the term of each expires; the date appointed for the next annual meeting of the stockholders for the election of directors; the number of shares of each class of its capital stock which it is authorized to issue, if any, and the par value thereof when applicable; and the number of shares of each class of the capital stock actually issued, if any; the amount of capital invested in real estate and other property in this State, and the tax paid thereon; and, if exempt from taxation in this State for any cause, the specific facts entitling the corporation to such exemption from taxation."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 374",
    "56 Del. Laws, c. 50",
    "64 Del. Laws, c. 112, § 60",
    "78 Del. Laws, c. 96, § 13",
    "79 Del. Laws, c. 122, § 9"
  ]
}
