{
  "jurisdiction": "US-DE",
  "provision": [
    {
      "subdivision": "code",
      "number": "Delaware Code"
    },
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "XVI"
    },
    {
      "subdivision": "section",
      "number": "376"
    }
  ],
  "heading": "Service of process upon qualified foreign corporations",
  "content": [
    {
      "number": "(a)",
      "content": "All process issued out of any court of this State, all orders made by any court of this State, all rules and notices of any kind required to be served on any foreign corporation which has qualified to do business in this State may be served on the registered agent of the corporation designated in accordance with § 371 of this title, or, if there be no such agent, then on any officer, director or other agent of the corporation then in this State."
    },
    {
      "number": "(b)",
      "content": "In case the officer whose duty it is to serve legal process cannot by due diligence serve the process in any manner provided for by subsection (a) of this section, it shall be lawful to serve the process against the corporation upon the Secretary of State, and such service shall be as effectual for all intents and purposes as if made in any of the ways provided for in subsection (a) of this section. Process may be served upon the Secretary of State under this subsection by means of electronic transmission but only as prescribed by the Secretary of State. The Secretary of State is authorized to issue such rules and regulations with respect to such service as the Secretary of State deems necessary or appropriate. In the event that service is effected through the Secretary of State in accordance with this subsection, the Secretary of State shall forthwith notify the corporation by letter, directed to the corporation at its principal place of business as it appears on the last annual report filed pursuant to § 374 of this title or, if no such address appears, at its last registered office. Such letter shall be sent by a mail or courier service that includes a record of mailing or deposit with the courier and a record of delivery evidenced by the signature of the recipient. Such letter shall enclose a copy of the process and any other papers served upon the Secretary of State pursuant to this subsection. It shall be the duty of the plaintiff in the event of such service to serve process and any other papers in duplicate, to notify the Secretary of State that service is being effected pursuant to this subsection, and to pay the Secretary of State the sum of $50 for the use of the State, which sum shall be taxed as a part of the costs in the proceeding if the plaintiff shall prevail therein. The Secretary of State shall maintain an alphabetical record of any such service setting forth the name of the plaintiff and the defendant, the title, docket number and nature of the proceeding in which process has been served upon the Secretary of State, the fact that service has been effected pursuant to this subsection, the return date thereof, and the day and hour when the service was made. The Secretary of State shall not be required to retain such information for a period longer than 5 years from receipt of such service."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 376",
    "56 Del. Laws, c. 50",
    "56 Del. Laws, c. 186, § 28",
    "64 Del. Laws, c. 112, § 61",
    "67 Del. Laws, c. 190, § 8",
    "71 Del. Laws, c. 339, § 81",
    "77 Del. Laws, c. 290, § 30",
    "79 Del. Laws, c. 122, § 9"
  ]
}
