{
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "VII"
    },
    {
      "subdivision": "section",
      "number": "218"
    }
  ],
  "heading": "Voting trusts and other voting agreements.",
  "content": [
    {
      "number": "(a)",
      "content": "One stockholder or 2 or more stockholders may by agreement in writing deposit capital stock of an original issue with or transfer capital stock to any person or persons, or entity or entities authorized to act as trustee, for the purpose of vesting in such person or persons, entity or entities, who may be designated voting trustee, or voting trustees, the right to vote thereon for any period of time determined by such agreement, upon the terms and conditions stated in such agreement. The agreement may contain any other lawful provisions not inconsistent with such purpose. After delivery of a copy of the agreement to the registered office of the corporation in this State or the principal place of business of the corporation, which copy shall be open to the inspection of any stockholder of the corporation or any beneficiary of the trust under the agreement daily during business hours, certificates of stock or uncertificated stock shall be issued to the voting trustee or trustees to represent any stock of an original issue so deposited with such voting trustee or trustees, and any certificates of stock or uncertificated stock so transferred to the voting trustee or trustees shall be surrendered and cancelled and new certificates or uncertificated stock shall be issued therefore to the voting trustee or trustees. In the certificate so issued, if any, it shall be stated that it is issued pursuant to such agreement, and that fact shall also be stated in the stock ledger of the corporation. The voting trustee or trustees may vote the stock so issued or transferred during the period specified in the agreement. Stock standing in the name of the voting trustee or trustees may be voted either in person or by proxy, and in voting the stock, the voting trustee or trustees shall incur no responsibility as stockholder, trustee or otherwise, except for their own individual malfeasance. In any case where 2 or more persons or entities are designated as voting trustees, and the right and method of voting any stock standing in their names at any meeting of the corporation are not fixed by the agreement appointing the trustees, the right to vote the stock and the manner of voting it at the meeting shall be determined by a majority of the trustees, or if they be equally divided as to the right and manner of voting the stock in any particular case, the vote of the stock in such case shall be divided equally among the trustees."
    },
    {
      "number": "(b)",
      "content": "Any amendment to a voting trust agreement shall be made by a written agreement, a copy of which shall be delivered to the registered office of the corporation in this State or principal place of business of the corporation."
    },
    {
      "number": "(c)",
      "content": "An agreement between 2 or more stockholders, if in writing and signed by the parties thereto, may provide that in exercising any voting rights, the shares held by them shall be voted as provided by the agreement, or as the parties may agree, or as determined in accordance with a procedure agreed upon by them."
    },
    {
      "number": "(d)",
      "content": "This section shall not be deemed to invalidate any voting or other agreement among stockholders or any irrevocable proxy which is not otherwise illegal."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 218",
    "56 Del. Laws, c. 50",
    "56 Del. Laws, c. 186, § 13",
    "57 Del. Laws, c. 148, § 14",
    "63 Del. Laws, c. 25, § 8",
    "64 Del. Laws, c. 112, § 22",
    "69 Del. Laws, c. 263, §§ 1-6",
    "70 Del. Laws, c. 186, § 1",
    "71 Del. Laws, c. 339, § 38",
    "73 Del. Laws, c. 82, § 10",
    "79 Del. Laws, c. 327, § 4"
  ]
}
