{
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "VII"
    },
    {
      "subdivision": "section",
      "number": "220"
    }
  ],
  "heading": "Inspection of books and records.",
  "content": [
    {
      "number": "(a)",
      "content": "As used in this section:"
    },
    {
      "number": "(1)",
      "content": "\"Stockholder” means a holder of record of stock in a stock corporation, or a person who is the beneficial owner of shares of such stock held either in a voting trust or by a nominee on behalf of such person."
    },
    {
      "number": "(2)",
      "content": "\"Subsidiary” means any entity directly or indirectly owned, in whole or in part, by the corporation of which the stockholder is a stockholder and over the affairs of which the corporation directly or indirectly exercises control, and includes, without limitation, corporations, partnerships, limited partnerships, limited liability partnerships, limited liability companies, statutory trusts and/or joint ventures."
    },
    {
      "number": "(3)",
      "content": "\"Under oath” includes statements the declarant affirms to be true under penalty of perjury under the laws of the United States or any state."
    },
    {
      "number": "(b)",
      "content": [
        {
          "type": "paragraph",
          "text": "Any stockholder, in person or by attorney or other agent, shall, upon written demand under oath stating the purpose thereof, have the right during the usual hours for business to inspect for any proper purpose, and to make copies and extracts from:"
        },
        {
          "number": "(1)",
          "content": "The corporation’s stock ledger, a list of its stockholders, and its other books and records; and"
        },
        {
          "number": "(2)",
          "content": [
            {
              "type": "paragraph",
              "text": "A subsidiary’s books and records, to the extent that:"
            },
            {
              "number": "a.",
              "content": "The corporation has actual possession and control of such records of such subsidiary; or"
            },
            {
              "number": "b.",
              "content": [
                {
                  "type": "paragraph",
                  "text": "The corporation could obtain such records through the exercise of control over such subsidiary, provided that as of the date of the making of the demand:"
                },
                {
                  "number": "1.",
                  "content": "The stockholder inspection of such books and records of the subsidiary would not constitute a breach of an agreement between the corporation or the subsidiary and a person or persons not affiliated with the corporation; and"
                },
                {
                  "number": "2.",
                  "content": "The subsidiary would not have the right under the law applicable to it to deny the corporation access to such books and records upon demand by the corporation."
                },
                {
                  "type": "paragraph",
                  "text": "In every instance where the stockholder is other than a record holder of stock in a stock corporation, or a member of a nonstock corporation, the demand under oath shall state the person’s status as a stockholder, be accompanied by documentary evidence of beneficial ownership of the stock, and state that such documentary evidence is a true and correct copy of what it purports to be. A proper purpose shall mean a purpose reasonably related to such person’s interest as a stockholder. In every instance where an attorney or other agent shall be the person who seeks the right to inspection, the demand under oath shall be accompanied by a power of attorney or such other writing which authorizes the attorney or other agent to so act on behalf of the stockholder. The demand under oath shall be directed to the corporation at its registered office in this State or at its principal place of business."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "number": "(c)",
      "content": [
        {
          "type": "paragraph",
          "text": "If the corporation, or an officer or agent thereof, refuses to permit an inspection sought by a stockholder or attorney or other agent acting for the stockholder pursuant to subsection (b) of this section or does not reply to the demand within 5 business days after the demand has been made, the stockholder may apply to the Court of Chancery for an order to compel such inspection. The Court of Chancery is hereby vested with exclusive jurisdiction to determine whether or not the person seeking inspection is entitled to the inspection sought. The Court may summarily order the corporation to permit the stockholder to inspect the corporation’s stock ledger, an existing list of stockholders, and its other books and records, and to make copies or extracts therefrom; or the Court may order the corporation to furnish to the stockholder a list of its stockholders as of a specific date on condition that the stockholder first pay to the corporation the reasonable cost of obtaining and furnishing such list and on such other conditions as the Court deems appropriate. Where the stockholder seeks to inspect the corporation’s books and records, other than its stock ledger or list of stockholders, such stockholder shall first establish that:"
        },
        {
          "number": "(1)",
          "content": "Such stockholder is a stockholder;"
        },
        {
          "number": "(2)",
          "content": "Such stockholder has complied with this section respecting the form and manner of making demand for inspection of such documents; and"
        },
        {
          "number": "(3)",
          "content": "The inspection such stockholder seeks is for a proper purpose."
        },
        {
          "type": "paragraph",
          "text": "Where the stockholder seeks to inspect the corporation’s stock ledger or list of stockholders and establishes that such stockholder is a stockholder and has complied with this section respecting the form and manner of making demand for inspection of such documents, the burden of proof shall be upon the corporation to establish that the inspection such stockholder seeks is for an improper purpose. The Court may, in its discretion, prescribe any limitations or conditions with reference to the inspection, or award such other or further relief as the Court may deem just and proper. The Court may order books, documents and records, pertinent extracts therefrom, or duly authenticated copies thereof, to be brought within this State and kept in this State upon such terms and conditions as the order may prescribe."
        }
      ]
    },
    {
      "number": "(d)",
      "content": "Any director shall have the right to examine the corporation’s stock ledger, a list of its stockholders and its other books and records for a purpose reasonably related to the director’s position as a director. The Court of Chancery is hereby vested with the exclusive jurisdiction to determine whether a director is entitled to the inspection sought. The Court may summarily order the corporation to permit the director to inspect any and all books and records, the stock ledger and the list of stockholders and to make copies or extracts therefrom. The burden of proof shall be upon the corporation to establish that the inspection such director seeks is for an improper purpose. The Court may, in its discretion, prescribe any limitations or conditions with reference to the inspection, or award such other and further relief as the Court may deem just and proper."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 220",
    "56 Del. Laws, c. 50",
    "63 Del. Laws, c. 25, § 9",
    "70 Del. Laws, c. 79, §§ 11, 12",
    "70 Del. Laws, c. 186, § 1",
    "71 Del. Laws, c. 339, § 39",
    "74 Del. Laws, c. 84, §§ 5-8",
    "77 Del. Laws, c. 253, §§ 20-23"
  ]
}
