{
  "jurisdiction": "US-DE",
  "provision": [
    {
      "subdivision": "code",
      "number": "Delaware Code"
    },
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "VII"
    },
    {
      "subdivision": "section",
      "number": "231"
    }
  ],
  "heading": "Voting procedures and inspectors of elections",
  "content": [
    {
      "number": "(a)",
      "content": "The corporation shall, in advance of any meeting of stockholders, appoint 1 or more inspectors to act at the meeting and make a written report thereof. The corporation may designate 1 or more persons as alternate inspectors to replace any inspector who fails to act. If no inspector or alternate is able to act at a meeting of stockholders, the person presiding at the meeting shall appoint 1 or more inspectors to act at the meeting. Each inspector, before entering upon the discharge of the duties of inspector, shall take and sign an oath faithfully to execute the duties of inspector with strict impartiality and according to the best of such inspector’s ability."
    },
    {
      "number": "(b)",
      "content": [
        {
          "type": "paragraph",
          "text": "The inspectors shall:"
        },
        {
          "number": "(1)",
          "content": "Ascertain the number of shares outstanding and the voting power of each;"
        },
        {
          "number": "(2)",
          "content": "Determine the shares represented at a meeting and the validity of proxies and ballots;"
        },
        {
          "number": "(3)",
          "content": "Count all votes and ballots;"
        },
        {
          "number": "(4)",
          "content": "Determine and retain for a reasonable period a record of the disposition of any challenges made to any determination by the inspectors; and"
        },
        {
          "number": "(5)",
          "content": "Certify their determination of the number of shares represented at the meeting, and their count of all votes and ballots."
        },
        {
          "type": "paragraph",
          "text": "The inspectors may appoint or retain other persons or entities to assist the inspectors in the performance of the duties of the inspectors."
        }
      ]
    },
    {
      "number": "(c)",
      "content": "The date and time of the opening and the closing of the polls for each matter upon which the stockholders will vote at a meeting shall be announced at the meeting. No ballot, proxies or votes, nor any revocations thereof or changes thereto, shall be accepted by the inspectors after the closing of the polls unless the Court of Chancery upon application by a stockholder shall determine otherwise."
    },
    {
      "number": "(d)",
      "content": "In determining the validity and counting of proxies and ballots, the inspectors shall be limited to an examination of the proxies, any envelopes submitted with those proxies, any information provided in accordance with § 211(e) or § 212(c)(2) of this title, or any information provided pursuant to § 211(a)(2)b.(i) or (iii) of this title, ballots and the regular books and records of the corporation, except that the inspectors may consider other reliable information for the limited purpose of reconciling proxies and ballots submitted by or on behalf of banks, brokers, their nominees or similar persons which represent more votes than the holder of a proxy is authorized by the record owner to cast or more votes than the stockholder holds of record. If the inspectors consider other reliable information for the limited purpose permitted herein, the inspectors at the time they make their certification pursuant to paragraph (b)(5) of this section shall specify the precise information considered by them including the person or persons from whom they obtained the information, when the information was obtained, the means by which the information was obtained and the basis for the inspectors’ belief that such information is accurate and reliable."
    },
    {
      "number": "(e)",
      "content": [
        {
          "type": "paragraph",
          "text": "Unless otherwise provided in the certificate of incorporation or bylaws, this section shall not apply to a corporation that does not have a class of voting stock that is:"
        },
        {
          "number": "(1)",
          "content": "Listed on a national securities exchange;"
        },
        {
          "number": "(2)",
          "content": "Authorized for quotation on an interdealer quotation system of a registered national securities association; or"
        },
        {
          "number": "(3)",
          "content": "Held of record by more than 2,000 stockholders."
        }
      ]
    }
  ],
  "history": [
    "67 Del. Laws, c. 376, § 9",
    "71 Del. Laws, c. 339, § 42",
    "72 Del. Laws, c. 343, § 18"
  ]
}
