{
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "II"
    },
    {
      "subdivision": "section",
      "number": "122"
    }
  ],
  "heading": "Specific powers.",
  "content": [
    {
      "type": "paragraph",
      "text": "Every corporation created under this chapter shall have power to:"
    },
    {
      "number": "(1)",
      "content": "Have perpetual succession by its corporate name, unless a limited period of duration is stated in its certificate of incorporation;"
    },
    {
      "number": "(2)",
      "content": "Sue and be sued in all courts and participate, as a party or otherwise, in any judicial, administrative, arbitrative or other proceeding, in its corporate name;"
    },
    {
      "number": "(3)",
      "content": "Have a corporate seal, which may be altered at pleasure, and use the same by causing it or a facsimile thereof, to be impressed or affixed or in any other manner reproduced;"
    },
    {
      "number": "(4)",
      "content": "Purchase, receive, take by grant, gift, devise, bequest or otherwise, lease, or otherwise acquire, own, hold, improve, employ, use and otherwise deal in and with real or personal property, or any interest therein, wherever situated, and to sell, convey, lease, exchange, transfer or otherwise dispose of, or mortgage or pledge, all or any of its property and assets, or any interest therein, wherever situated;"
    },
    {
      "number": "(5)",
      "content": "Appoint such officers and agents as the business of the corporation requires and to pay or otherwise provide for them suitable compensation;"
    },
    {
      "number": "(6)",
      "content": "Adopt, amend and repeal bylaws;"
    },
    {
      "number": "(7)",
      "content": "Wind up and dissolve itself in the manner provided in this chapter;"
    },
    {
      "number": "(8)",
      "content": "Conduct its business, carry on its operations and have offices and exercise its powers within or without this State;"
    },
    {
      "number": "(9)",
      "content": "Make donations for the public welfare or for charitable, scientific or educational purposes, and in time of war or other national emergency in aid thereof;"
    },
    {
      "number": "(10)",
      "content": "Be an incorporator, promoter or manager of other corporations of any type or kind;"
    },
    {
      "number": "(11)",
      "content": "Participate with others in any corporation, partnership, limited partnership, joint venture or other association of any kind, or in any transaction, undertaking or arrangement which the participating corporation would have power to conduct by itself, whether or not such participation involves sharing or delegation of control with or to others;"
    },
    {
      "number": "(12)",
      "content": "Transact any lawful business which the corporation’s board of directors shall find to be in aid of governmental authority;"
    },
    {
      "number": "(13)",
      "content": "Make contracts, including contracts of guaranty and suretyship, incur liabilities, borrow money at such rates of interest as the corporation may determine, issue its notes, bonds and other obligations, and secure any of its obligations by mortgage, pledge or other encumbrance of all or any of its property, franchises and income, and make contracts of guaranty and suretyship which are necessary or convenient to the conduct, promotion or attainment of the business of (a) a corporation all of the outstanding stock of which is owned, directly or indirectly, by the contracting corporation, or (b) a corporation which owns, directly or indirectly, all of the outstanding stock of the contracting corporation, or (c) a corporation all of the outstanding stock of which is owned, directly or indirectly, by a corporation which owns, directly or indirectly, all of the outstanding stock of the contracting corporation, which contracts of guaranty and suretyship shall be deemed to be necessary or convenient to the conduct, promotion or attainment of the business of the contracting corporation, and make other contracts of guaranty and suretyship which are necessary or convenient to the conduct, promotion or attainment of the business of the contracting corporation;"
    },
    {
      "number": "(14)",
      "content": "Lend money for its corporate purposes, invest and reinvest its funds, and take, hold and deal with real and personal property as security for the payment of funds so loaned or invested;"
    },
    {
      "number": "(15)",
      "content": "Pay pensions and establish and carry out pension, profit sharing, stock option, stock purchase, stock bonus, retirement, benefit, incentive and compensation plans, trusts and provisions for any or all of its directors, officers and employees, and for any or all of the directors, officers and employees of its subsidiaries;"
    },
    {
      "number": "(16)",
      "content": "Provide insurance for its benefit on the life of any of its directors, officers or employees, or on the life of any stockholder for the purpose of acquiring at such stockholder’s death shares of its stock owned by such stockholder."
    },
    {
      "number": "(17)",
      "content": "Renounce, in its certificate of incorporation or by action of its board of directors, any interest or expectancy of the corporation in, or in being offered an opportunity to participate in, specified business opportunities or specified classes or categories of business opportunities that are presented to the corporation or 1 or more of its officers, directors or stockholders."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 122",
    "56 Del. Laws, c. 50",
    "57 Del. Laws, c. 148, § 3",
    "64 Del. Laws, c. 112, § 3",
    "65 Del. Laws, c. 127, § 2",
    "71 Del. Laws, c. 339, § 7",
    "72 Del. Laws, c. 343, § 3"
  ]
}
