{
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "XIV"
    },
    {
      "subdivision": "section",
      "number": "353"
    }
  ],
  "heading": "Appointment of a provisional director in certain cases",
  "content": [
    {
      "number": "(a)",
      "content": "Notwithstanding any contrary provision of the certificate of incorporation or the bylaws or agreement of the stockholders, the Court of Chancery may appoint a provisional director for a close corporation if the directors are so divided respecting the management of the corporation’s business and affairs that the votes required for action by the board of directors cannot be obtained with the consequence that the business and affairs of the corporation can no longer be conducted to the advantage of the stockholders generally."
    },
    {
      "number": "(b)",
      "content": "An application for relief under this section must be filed (1) by at least one half of the number of directors then in office, (2) by the holders of at least one third of all stock then entitled to elect directors, or, (3) if there be more than 1 class of stock then entitled to elect 1 or more directors, by the holders of two thirds of the stock of any such class; but the certificate of incorporation of a close corporation may provide that a lesser proportion of the directors or of the stockholders or of a class of stockholders may apply for relief under this section."
    },
    {
      "number": "(c)",
      "content": "A provisional director shall be an impartial person who is neither a stockholder nor a creditor of the corporation or of any subsidiary or affiliate of the corporation, and whose further qualifications, if any, may be determined by the Court of Chancery. A provisional director is not a receiver of the corporation and does not have the title and powers of a custodian or receiver appointed under §§ 226 and 291 of this title. A provisional director shall have all the rights and powers of a duly elected director of the corporation, including the right to notice of and to vote at meetings of directors, until such time as such person shall be removed by order of the Court of Chancery or by the holders of a majority of all shares then entitled to vote to elect directors or by the holders of two thirds of the shares of that class of voting shares which filed the application for appointment of a provisional director. A provisional director’s compensation shall be determined by agreement between such person and the corporation subject to approval of the Court of Chancery, which may fix such person’s compensation in the absence of agreement or in the event of disagreement between the provisional director and the corporation."
    },
    {
      "number": "(d)",
      "content": "Even though the requirements of subsection (b) of this section relating to the number of directors or stockholders who may petition for appointment of a provisional director are not satisfied, the Court of Chancery may nevertheless appoint a provisional director if permitted by § 352(b) of this title."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 353",
    "56 Del. Laws, c. 50",
    "71 Del. Laws, c. 339, § 78"
  ]
}
