{
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "XIV"
    },
    {
      "subdivision": "section",
      "number": "355"
    }
  ],
  "heading": "Stockholders' option to dissolve corporation.",
  "content": [
    {
      "number": "(a)",
      "content": "The certificate of incorporation of any close corporation may include a provision granting to any stockholder, or to the holders of any specified number or percentage of shares of any class of stock, an option to have the corporation dissolved at will or upon the occurrence of any specified event or contingency. Whenever any such option to dissolve is exercised, the stockholders exercising such option shall give written notice thereof to all other stockholders. After the expiration of 30 days following the sending of such notice, the dissolution of the corporation shall proceed as if the required number of stockholders having voting power had consented in writing to dissolution of the corporation as provided by ยง 228 of this title."
    },
    {
      "number": "(b)",
      "content": "If the certificate of incorporation as originally filed does not contain a provision authorized by subsection (a) of this section, the certificate may be amended to include such provision if adopted by the affirmative vote of the holders of all the outstanding stock, whether or not entitled to vote, unless the certificate of incorporation specifically authorizes such an amendment by a vote which shall be not less than 2/3 of all the outstanding stock whether or not entitled to vote."
    },
    {
      "number": "(c)",
      "content": "Each stock certificate in any corporation whose certificate of incorporation authorizes dissolution as permitted by this section shall conspicuously note on the face thereof the existence of the provision. Unless noted conspicuously on the face of the stock certificate, the provision is ineffective."
    }
  ],
  "history": [
    "8 Del. C. 1953, ยง 355",
    "56 Del. Laws, c. 50",
    "56 Del. Laws, c. 186, ยง 27"
  ]
}
