{
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "XIII"
    },
    {
      "subdivision": "section",
      "number": "321"
    }
  ],
  "heading": "Service of process on corporations.",
  "content": [
    {
      "number": "(a)",
      "content": "Service of legal process upon any corporation of this State shall be made by delivering a copy personally to any officer or director of the corporation in this State, or the registered agent of the corporation in this State, or by leaving it at the dwelling house or usual place of abode in this State of any officer, director or registered agent (if the registered agent be an individual), or at the registered office or other place of business of the corporation in this State. If the registered agent be a corporation, service of process upon it as such agent may be made by serving, in this State, a copy thereof on the president, vice-president, secretary, assistant secretary or any director of the corporate registered agent. Service by copy left at the dwelling house or usual place of abode of any officer, director or registered agent, or at the registered office or other place of business of the corporation in this State, to be effective must be delivered thereat at least 6 days before the return date of the process, and in the presence of an adult person, and the officer serving the process shall distinctly state the manner of service in such person’s return thereto. Process returnable forthwith must be delivered personally to the officer, director or registered agent."
    },
    {
      "number": "(b)",
      "content": "In case the officer whose duty it is to serve legal process cannot by due diligence serve the process in any manner provided for by subsection (a) of this section, it shall be lawful to serve the process against the corporation upon the Secretary of State, and such service shall be as effectual for all intents and purposes as if made in any of the ways provided for in subsection (a) of this section. Process may be served upon the Secretary of State under this subsection by means of electronic transmission but only as prescribed by the Secretary of State. The Secretary of State is authorized to issue such rules and regulations with respect to such service as the Secretary of State deems necessary or appropriate. In the event that service is effected through the Secretary of State in accordance with this subsection, the Secretary of State shall forthwith notify the corporation by letter, directed to the corporation at its principal place of business as it appears on the records relating to such corporation on file with the Secretary of State or, if no such address appears, at its last registered office. Such letter shall be sent by a mail or courier service that includes a record of mailing or deposit with the courier and a record of delivery evidenced by the signature of the recipient. Such letter shall enclose a copy of the process and any other papers served on the Secretary of State pursuant to this subsection. It shall be the duty of the plaintiff in the event of such service to serve process and any other papers in duplicate, to notify the Secretary of State that service is being effected pursuant to this subsection, and to pay the Secretary of State the sum of $50 for the use of the State, which sum shall be taxed as part of the costs in the proceeding if the plaintiff shall prevail therein. The Secretary of State shall maintain an alphabetical record of any such service setting forth the name of the plaintiff and defendant, the title, docket number and nature of the proceeding in which process has been served upon the Secretary of State, the fact that service has been effected pursuant to this subsection, the return date thereof, and the day and hour when the service was made. The Secretary of State shall not be required to retain such information for a period longer than 5 years from receipt of the service of process."
    },
    {
      "number": "(c)",
      "content": "Service upon corporations may also be made in accordance with § 3111 of Title 10 or any other statute or rule of court."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 321",
    "56 Del. Laws, c. 50",
    "64 Del. Laws, c. 112, § 57",
    "67 Del. Laws, c. 190, § 7",
    "71 Del. Laws, c. 339, §§ 65, 66",
    "77 Del. Laws, c. 290, § 27"
  ]
}
