{
  "jurisdiction": "US-DE",
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "XIII"
    },
    {
      "subdivision": "section",
      "number": "324"
    }
  ],
  "heading": "Attachment of shares of stock or any option, right or interest therein; procedure; sale; title upon sale; proceeds",
  "content": [
    {
      "number": "(a)",
      "content": "The shares of any person in any corporation with all the rights thereto belonging, or any person’s option to acquire the shares, or such person’s right or interest in the shares, may be attached under this section for debt, or other demands, if such person appears on the books of the corporation to hold or own such shares, option, right or interest. So many of the shares, or so much of the option, right or interest therein may be sold at public sale to the highest bidder, as shall be sufficient to satisfy the debt, or other demand, interest and costs, upon an order issued therefor by the court from which the attachment process issued, and after such notice as is required for sales upon execution process. Except as to an uncertificated security as defined in § 8-102 of Title 6, the attachment is not laid and no order of sale shall issue unless § 8-112 of Title 6 has been satisfied. No order of sale shall be issued until after final judgment shall have been rendered in any case. If the debtor lives out of the county, a copy of the order shall be sent by registered or certified mail, return receipt requested, to such debtor’s last known address, and shall also be published in a newspaper published in the county of such debtor’s last known residence, if there be any, 10 days before the sale; and if the debtor be a nonresident of this State shall be mailed as aforesaid and published at least twice for 2 successive weeks, the last publication to be at least 10 days before the sale, in a newspaper published in the county where the attachment process issued. If the shares of stock or any of them or the option to acquire shares or any such right or interest in shares, or any part of them, be so sold, any assignment, or transfer thereof, by the debtor, after attachment, shall be void."
    },
    {
      "number": "(b)",
      "content": "When attachment process issues for shares of stock, or any option to acquire such or any right or interest in such, a certified copy of the process shall be left in this State with any officer or director, or with the registered agent of the corporation. Within 20 days after service of the process, the corporation shall serve upon the plaintiff a certificate of the number of shares held or owned by the debtor in the corporation, with the number or other marks distinguishing the same, or in the case the debtor appears on the books of the corporation to have an option to acquire shares of stock or any right or interest in any shares of stock of the corporation, there shall be served upon the plaintiff within 20 days after service of the process a certificate setting forth any such option, right or interest in the shares of the corporation in the language and form in which the option, right or interest appears on the books of the corporation, anything in the certificate of incorporation or bylaws of the corporation to the contrary notwithstanding. Service upon a corporate registered agent may be made in the manner provided in § 321 of this title."
    },
    {
      "number": "(c)",
      "content": "If, after sale made and confirmed, a certified copy of the order of sale and return and the stock certificate, if any, be left with any officer or director or with the registered agent of the corporation, the purchaser shall be thereby entitled to the shares or any option to acquire shares or any right or interest in shares so purchased, and all income, or dividends which may have been declared, or become payable thereon since the attachment laid. Such sale, returned and confirmed, shall transfer the shares or the option to acquire shares or any right or interest in shares sold to the purchaser, as fully as if the debtor, or defendant, had transferred the same to such purchaser according to the certificate of incorporation or bylaws of the corporation, anything in the certificate of incorporation or bylaws to the contrary notwithstanding. The court which issued the levy and confirmed the sale shall have the power to make an order compelling the corporation, the shares of which were sold, to issue new certificates or uncertificated shares to the purchaser at the sale and to cancel the registration of the shares attached on the books of the corporation upon the giving of an open end bond by such purchaser adequate to protect such corporation."
    },
    {
      "number": "(d)",
      "content": "The money arising from the sale of the shares or from the sale of the option or right or interest shall be applied and paid, by the public official receiving the same, as by law is directed as to the sale of personal property in cases of attachment."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 324",
    "56 Del. Laws, c. 50",
    "59 Del. Laws, c. 106, § 17",
    "64 Del. Laws, c. 112, § 58",
    "71 Del. Laws, c. 339, §§ 68-70"
  ]
}
