{
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "II"
    },
    {
      "subdivision": "section",
      "number": "124"
    }
  ],
  "heading": "Effect of lack of corporate capacity or power; ultra vires",
  "content": [
    {
      "type": "paragraph",
      "text": "No act of a corporation and no conveyance or transfer of real or personal property to or by a corporation shall be invalid by reason of the fact that the corporation was without capacity or power to do such act or to make or receive such conveyance or transfer, but such lack of capacity or power may be asserted:"
    },
    {
      "number": "(1)",
      "content": "In a proceeding by a stockholder against the corporation to enjoin the doing of any act or acts or the transfer of real or personal property by or to the corporation. If the unauthorized acts or transfer sought to be enjoined are being, or are to be, performed or made pursuant to any contract to which the corporation is a party, the court may, if all of the parties to the contract are parties to the proceeding and if it deems the same to be equitable, set aside and enjoin the performance of such contract, and in so doing may allow to the corporation or to the other parties to the contract, as the case may be, such compensation as may be equitable for the loss or damage sustained by any of them which may result from the action of the court in setting aside and enjoining the performance of such contract, but anticipated profits to be derived from the performance of the contract shall not be awarded by the court as a loss or damage sustained;"
    },
    {
      "number": "(2)",
      "content": "In a proceeding by the corporation, whether acting directly or through a receiver, trustee or other legal representative, or through stockholders in a representative suit, against an incumbent or former officer or director of the corporation, for loss or damage due to such incumbent or former officer’s or director’s unauthorized act;"
    },
    {
      "number": "(3)",
      "content": "In a proceeding by the Attorney General to dissolve the corporation, or to enjoin the corporation from the transaction of unauthorized business."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 124",
    "56 Del. Laws, c. 50",
    "71 Del. Laws, c. 339, § 8"
  ]
}
