{
  "jurisdiction": "US-DE",
  "provision": [
    {
      "subdivision": "code",
      "number": "Delaware Code"
    },
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "II"
    },
    {
      "subdivision": "section",
      "number": "125"
    }
  ],
  "heading": "Conferring academic or honorary degrees",
  "content": [
    {
      "type": "paragraph",
      "text": "No corporation organized after April 18, 1945, shall have power to confer academic or honorary degrees unless the certificate of incorporation or an amendment thereof shall so provide and unless the certificate of incorporation or an amendment thereof prior to its being filed in the office of the Secretary of State shall have endorsed thereon the approval of the Department of Education of this State. No corporation organized before April 18, 1945, any provision in its certificate of incorporation to the contrary notwithstanding, shall possess the power aforesaid without first filing in the office of the Secretary of State a certificate of amendment so providing, the filing of which certificate of amendment in the office of the Secretary of State shall be subject to prior approval of the Department of Education, evidenced as hereinabove provided. Approval shall be granted only when it appears to the reasonable satisfaction of the Department of Education that the corporation is engaged in conducting a bona fide institution of higher learning, giving instructions in arts and letters, science or the professions, or that the corporation proposes, in good faith, to engage in that field and has or will have the resources, including personnel, requisite for the conduct of an institution of higher learning. Upon dissolution, all such corporations shall comply with § 8530 of Title 14. Notwithstanding any provision herein to the contrary, no corporation shall have the power to conduct a private business or trade school unless the certificate of incorporation or an amendment thereof, prior to its being filed in the office of the Secretary of State, shall have endorsed thereon the approval of the Department of Education pursuant to Chapter 85 of Title 14."
    },
    {
      "type": "paragraph",
      "text": "Notwithstanding the foregoing provisions, any corporation conducting a law school, which has its principal place of operation in Delaware, and which intends to meet the standards of approval of the American Bar Association, may, after it has been in actual operation for not less than 1 year, retain at its own expense a dean or dean emeritus of a law school fully approved by the American Bar Association to make an on-site inspection and report concerning the progress of the corporation toward meeting the standards for approval by the American Bar Association. Such dean or dean emeritus shall be chosen by the Attorney General from a panel of 3 deans whose names are presented to the Attorney General as being willing to serve. One such dean on this panel shall be nominated by the trustees of said law school corporation; another dean shall be nominated by a committee of the Student Bar Association of said law school; and the other dean shall be nominated by a committee of lawyers who are parents of students attending such law school. If any of the above-named groups cannot find a dean, it may substitute 2 full professors of accredited law schools for the dean it is entitled to nominate, and in such a case if the Attorney General chooses 1 of such professors, such professor shall serve the function of a dean as herein prescribed. If the dean so retained shall report in writing that, in such dean’s professional judgment, the corporation is attempting, in good faith, to comply with the standards for approval of the American Bar Association and is making reasonable progress toward meeting such standards, the corporation may file a copy of the report with the Secretary of Education and with the Attorney General. Any corporation which complies with these provisions by filing such report shall be deemed to have temporary approval from the State and shall be entitled to amend its certificate of incorporation to authorize the granting of standard academic law degrees. Thereafter, until the law school operated by the corporation is approved by the American Bar Association, the corporation shall file once during each academic year a new report, in the same manner as the first report. If, at any time, the corporation fails to file such a report, or if the dean retained to render such report states that, in such dean’s opinion, the corporation is not continuing to make reasonable progress toward accreditation, the Attorney General, at the request of the Secretary of Education, may file a complaint in the Court of Chancery to suspend said temporary approval and degree-granting power until a further report is filed by a dean or dean emeritus of an accredited law school that the school has resumed its progress towards meeting the standards for approval. Upon approval of the law school by the American Bar Association, temporary approval shall become final, and shall no longer be subject to suspension or vacation under this section."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 125",
    "56 Del. Laws, c. 50",
    "59 Del. Laws, c. 207, § 1",
    "59 Del. Laws, c. 377, § 1",
    "65 Del. Laws, c. 103, § 2",
    "71 Del. Laws, c. 339, § 9",
    "72 Del. Laws, c. 433, § 1",
    "73 Del. Laws, c. 65, § 7",
    "74 Del. Laws, c. 249, § 1"
  ]
}
