{
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "XVIII"
    },
    {
      "subdivision": "section",
      "number": "391"
    }
  ],
  "heading": "Amounts payable to Secretary of State upon filing certificate or other paper",
  "content": [
    {
      "number": "(a)",
      "content": [
        {
          "type": "paragraph",
          "text": "The following fees and penalties shall be collected by and paid to the Secretary of State, for the use of the State:"
        },
        {
          "number": "(1)",
          "content": "Upon the receipt for filing of an original certificate of incorporation, the fee shall be computed on the basis of $0.02 for each share of authorized capital stock having par value up to and including 20,000 shares, $0.01 for each share in excess of 20,000 shares up to and including 200,000 shares, and 2/5 of a $0.01 for each share in excess of 200,000 shares; $0.01 for each share of authorized capital stock without par value up to and including 20,000 shares, 1/2 of $0.01 for each share in excess of 20,000 shares up to and including 2,000,000 shares, and 2/5 of $0.01 for each share in excess of 2,000,000 shares. In no case shall the amount paid be less than $15. For the purpose of computing the fee on par value stock each $100 unit of the authorized capital stock shall be counted as 1 assessable share."
        },
        {
          "number": "(2)",
          "content": "Upon the receipt for filing of a certificate of amendment of certificate of incorporation, or a certificate of amendment of certificate of incorporation before payment of capital, or a restated certificate of incorporation, increasing the authorized capital stock of a corporation, the fee shall be an amount equal to the difference between the fee computed at the foregoing rates upon the total authorized capital stock of the corporation including the proposed increase, and the fee computed at the foregoing rates upon the total authorized capital stock excluding the proposed increase. In no case shall the amount paid be less than $30."
        },
        {
          "number": "(3)",
          "content": "Upon the receipt for filing of a certificate of amendment of certificate of incorporation before payment of capital and not involving an increase of authorized capital stock, or an amendment to the certificate of incorporation not involving an increase of authorized capital stock, or a restated certificate of incorporation not involving an increase of authorized capital stock, or a certificate of retirement of stock, the fee to be paid shall be $30. For all other certificates relating to corporations, not otherwise provided for, the fee to be paid shall be $5.00. In the case of exempt corporations no fee shall be paid under this paragraph."
        },
        {
          "number": "(4)",
          "content": "Upon the receipt for filing of a certificate of merger or consolidation of 2 or more corporations, the fee shall be an amount equal to the difference between the fee computed at the foregoing rates upon the total authorized capital stock of the corporation created by the merger or consolidation, and the fee so computed upon the aggregate amount of the total authorized capital stock of the constituent corporations. In no case shall the amount paid be less than $75. The foregoing fee shall be in addition to any tax or fee required under any other law of this State to be paid by any constituent entity that is not a corporation in connection with the filing of the certificate of merger or consolidation."
        },
        {
          "number": "(5)",
          "content": [
            {
              "type": "paragraph",
              "text": "Upon the receipt for filing of a certificate of dissolution, there shall be paid to and collected by the Secretary of State a fee of:"
            },
            {
              "number": "a.",
              "content": "Forty dollars; or"
            },
            {
              "number": "b.",
              "content": [
                {
                  "type": "paragraph",
                  "text": "Ten dollars in the case of a certificate of dissolution which certifies that:"
                },
                {
                  "number": "1.",
                  "content": "The corporation has no assets and has ceased transacting business; and"
                },
                {
                  "number": "2.",
                  "content": "The corporation, for each year since its incorporation in this State, has been required to pay only the minimum franchise tax then prescribed by § 503 of this title; and"
                },
                {
                  "number": "3.",
                  "content": "The corporation has paid all franchise taxes and fees due to or assessable by this State through the end of the year in which said certificate of dissolution is filed."
                }
              ]
            }
          ]
        },
        {
          "number": "(6)",
          "content": "Upon the receipt for filing of a certificate of reinstatement of a foreign corporation or a certificate of surrender and withdrawal from the State by a foreign corporation, there shall be collected by and paid to the Secretary of State a fee of $10."
        },
        {
          "number": "(7)",
          "content": [
            {
              "type": "paragraph",
              "text": "For receiving and filing and/or indexing any certificate, affidavit, agreement or any other paper provided for by this chapter, for which no different fee is specifically prescribed, a fee of $115 in each case shall be paid to the Secretary of State. The fee in the case of a certificate of incorporation filed as required by § 102 of this title shall be $25. For entering information from each instrument into the Delaware Corporation Information System in accordance with § 103(c)(8) of this title, the fee shall be $5.00."
            },
            {
              "number": "a.",
              "content": "A certificate of dissolution which meets the criteria stated in paragraph (a)(5)b. of this section shall not be subject to such fee; and"
            },
            {
              "number": "b.",
              "content": "A certificate of incorporation filed in accordance with § 102 of this title shall be subject to a fee of $25."
            }
          ]
        },
        {
          "number": "(8)",
          "content": "For receiving and filing and/or indexing the annual report of a foreign corporation doing business in this State, a fee of $125 shall be paid. In the event of neglect, refusal or failure on the part of any foreign corporation to file the annual report with the Secretary of State on or before June 30 each year, the corporation shall pay a penalty of $125."
        },
        {
          "number": "(9)",
          "content": "For recording and indexing articles of association and other papers required by this chapter to be recorded by the Secretary of State, a fee computed on the basis of $0.01 a line shall be paid."
        },
        {
          "number": "(10)",
          "content": "For certifying copies of any paper on file provided by this chapter, a fee of $50 shall be paid for each copy certified. In addition, a fee of $2.00 per page shall be paid in each instance where the Secretary of State provides the copies of the document to be certified."
        },
        {
          "number": "(11)",
          "content": "For issuing any certificate of the Secretary of State other than a certification of a copy under paragraph (a)(10) of this section, or a certificate that recites all of a corporation’s filings with the Secretary of State, a fee of $50 shall be paid for each certificate. For issuing any certificate of the Secretary of State that recites all of a corporation’s filings with the Secretary of State, a fee of $175 shall be paid for each certificate."
        },
        {
          "number": "(12)",
          "content": "For filing in the office of the Secretary of State any certificate of change of location or change of registered agent, as provided in § 133 of this title, there shall be collected by and paid to the Secretary of State a fee of $50, provided that no fee shall be charged pursuant to § 103(c)(6) and (c)(7) of this title."
        },
        {
          "number": "(13)",
          "content": "For filing in the office of the Secretary of State any certificate of change of address or change of name of registered agent, as provided in § 134 of this title, there shall be collected by and paid to the Secretary of State a fee of $50, plus the same fees for receiving, filing, indexing, copying and certifying the same as are charged in the case of filing a certificate of incorporation."
        },
        {
          "number": "(14)",
          "content": "For filing in the office of the Secretary of State any certificate of resignation of a registered agent and appointment of a successor, as provided in § 135 of this title, there shall be collected by and paid to the Secretary of State a fee of $50."
        },
        {
          "number": "(15)",
          "content": "For filing in the office of the Secretary of State, any certificate of resignation of a registered agent without appointment of a successor, as provided in §§ 136 and 377 of this title, there shall be collected by and paid to the Secretary of State a fee of $2.00 for each corporation whose registered agent has resigned by such certificate."
        },
        {
          "number": "(16)",
          "content": "For preparing and providing a written report of a record search, a fee of $50 shall be paid."
        },
        {
          "number": "(17)",
          "content": "For preclearance of any document for filing, a fee of $250 shall be paid."
        },
        {
          "number": "(18)",
          "content": "For receiving and filing and/or indexing an annual franchise tax report of a corporation provided for by § 502 of this title, a fee of $25 shall be paid by exempt corporations and a fee of $50 shall be paid by all other corporations."
        },
        {
          "number": "(19)",
          "content": "For receiving and filing and/or indexing by the Secretary of State of a certificate of domestication and certificate of incorporation prescribed in § 388(d) of this title, a fee of $165, plus the fee payable upon the receipt for filing of an original certificate of incorporation, shall be paid."
        },
        {
          "number": "(20)",
          "content": "For receiving, reviewing and filing and/or indexing by the Secretary of State of the documents prescribed in § 389(c) of this title, a fee of $10,000 shall be paid."
        },
        {
          "number": "(21)",
          "content": "For receiving, reviewing and filing and/or indexing by the Secretary of State of the documents prescribed in § 389(d) of this title, an annual fee of $2,500 shall be paid."
        },
        {
          "number": "(22)",
          "content": "Except as provided in this section, the fees of the Secretary of State shall be as provided for in § 2315 of Title 29."
        },
        {
          "number": "(23)",
          "content": "In the case of exempt corporations, the total fees payable to the Secretary of State upon the filing of a Certificate of Change of Registered Agent and/or Registered Office or a Certificate of Revival shall be $5.00 and such filings shall be exempt from any fees or assessments pursuant to the requirements of § 103(c)(6) and (c)(7) of this title."
        },
        {
          "number": "(24)",
          "content": "For accepting a corporate name reservation application, an application for renewal of a corporate name reservation, or a notice of transfer or cancellation of a corporate name reservation, there shall be collected by and paid to the Secretary of State a fee of up to $75."
        },
        {
          "number": "(25)",
          "content": "For receiving and filing and/or indexing by the Secretary of State of a certificate of transfer or a certificate of continuance prescribed in § 390 of this title, a fee of $1,000 shall be paid."
        },
        {
          "number": "(26)",
          "content": "For receiving and filing and/or indexing by the Secretary of State of a certificate of conversion and certificate of incorporation prescribed in § 265 of this title, a fee of $115, plus the fee payable upon the receipt for filing of an original certificate of incorporation, shall be paid."
        },
        {
          "number": "(27)",
          "content": "For receiving and filing and/or indexing by the Secretary of State of a certificate of conversion prescribed in § 266 of this title, a fee of $165 shall be paid."
        },
        {
          "number": "(28)",
          "content": "For receiving and filing and/or indexing by the Secretary of State of a certificate of validation prescribed in § 204 of this title, a fee of $2,500 shall be paid; provided, that if the certificate of validation has the effect of increasing the authorized capital stock of a corporation, an additional fee, calculated in accordance with paragraph (a)(2) of this section, shall also be paid."
        }
      ]
    },
    {
      "number": "(b)",
      "content": [
        {
          "number": "(1)",
          "content": "For the purpose of computing the fee prescribed in paragraphs (a)(1), (2), (4) and (28) of this section the authorized capital stock of a corporation shall be considered to be the total number of shares which the corporation is authorized to issue, whether or not the total number of shares that may be outstanding at any 1 time be limited to a less number."
        },
        {
          "number": "(2)",
          "content": "For the purpose of computing the fee prescribed in paragraphs (a)(2), (3) and (28) of this section, a certificate of amendment of certificate of incorporation, or an amended certificate of incorporation before payment of capital, or a restated certificate of incorporation, or a certificate of validation, shall be considered as increasing the authorized capital stock of a corporation provided it involves an increase in the number of shares, or an increase in the par value of shares, or a change of shares with par value into shares without par value, or a change of shares without par value into shares with par value, or any combination of 2 or more of the above changes, and provided further that the fee computed at the rates set forth in paragraph (a)(1) of this section upon the total authorized capital stock of the corporation including the proposed change or changes exceeds the fee so computed upon the total authorized stock of the corporation excluding such change or changes."
        },
        {
          "number": "(c)",
          "content": "The Secretary of State may issue photocopies or electronic image copies of instruments on file, as well as instruments, documents and other papers not on file, and for all such photocopies or electronic image copies which are not certified by the Secretary of State, a fee of $10 shall be paid for the first page and $2.00 for each additional page. The Secretary of State may also issue microfiche copies of instruments on file as well as instruments, documents and other papers not on file, and for each such microfiche a fee of $2.00 shall be paid therefor. Notwithstanding Delaware’s Freedom of Information Act [Chapter 100 of Title 29] or other provision of this Code granting access to public records, the Secretary of State shall issue only photocopies, microfiche or electronic image copies of records in exchange for the fees described above."
        },
        {
          "number": "(d)",
          "content": "No fees for the use of the State shall be charged or collected from any corporation incorporated for the drainage and reclamation of lowlands or for the amendment or renewal of the charter of such corporation."
        },
        {
          "number": "(e)",
          "content": "The Secretary of State may in the Secretary of State’s discretion permit the extension of credit for the fees required by this section upon such terms as the Secretary of State shall deem to be appropriate."
        },
        {
          "number": "(f)",
          "content": "The Secretary of State shall retain from the revenue collected from the fees required by this section a sum sufficient to provide at all times a fund of at least $500, but not more than $1,500, from which the Secretary of State may refund any payment made pursuant to this section to the extent that it exceeds the fees required by this section. The fund shall be deposited in the financial institution which is the legal depository of state moneys to the credit of the Secretary of State and shall be disbursable on order of the Secretary of State."
        },
        {
          "number": "(g)",
          "content": "The Secretary of State may in the Secretary of State’s discretion charge a fee of $60 for each check received for payment of any fee or tax under Chapter 1 or Chapter 6 of this title that is returned due to insufficient funds or as the result of a stop payment order."
        },
        {
          "number": "(h)",
          "content": [
            {
              "type": "paragraph",
              "text": "In addition to those fees charged under subsections (a) and (c) of this section, there shall be collected by and paid to the Secretary of State the following:"
            },
            {
              "number": "(1)",
              "content": "For all services described in subsection (a) of this section that are requested to be completed within 30 minutes on the same day as the day of the request, an additional sum of up to $7,500 and for all services described in subsections (a) and (c) of this section that are requested to be completed within 1 hour on the same day as the day of the request, an additional sum of up to $1,000 and for all services described in subsections (a) and (c) of this section that are requested to be completed within 2 hours on the same day as the day of the request, an additional sum of up to $500; and"
            },
            {
              "number": "(2)",
              "content": "For all services described in subsections (a) and (c) of this section that are requested to be completed within the same day as the day of the request, an additional sum of up to $300; and"
            },
            {
              "number": "(3)",
              "content": "For all services described in subsections (a) and (c) of this section that are requested to be completed within a 24-hour period from the time of the request, an additional sum of up to $150."
            },
            {
              "type": "paragraph",
              "text": "The Secretary of State shall establish (and may from time to time alter or amend) a schedule of specific fees payable pursuant to this subsection."
            }
          ]
        },
        {
          "number": "(i)",
          "content": "A domestic corporation or a foreign corporation registered to do business in this State that files with the Secretary of State any instrument or certificate, and in connection therewith, neglects, refuses or fails to pay any fee or tax under Chapter 1 or Chapter 6 of this title shall, after written demand therefor by the Secretary of State by mail addressed to such domestic corporation or foreign corporation in care of its registered agent in this State, cease to be in good standing as a domestic corporation or registered as a foreign corporation in this State on the ninetieth day following the date of mailing of such demand, unless such fee or tax and, if applicable, the fee provided for in subsection (g) of this section are paid in full prior to the ninetieth day following the date of mailing of such demand. A domestic corporation that has ceased to be in good standing or a foreign corporation that has ceased to be registered by reason of the neglect, refusal or failure to pay any such fee or tax shall be restored to and have the status of a domestic corporation in good standing or a foreign corporation that is registered in this State upon the payment of the fee or tax which such domestic corporation or foreign corporation neglected, refused or failed to pay together with the fee provided for in subsection (g) of this section, if applicable. The Secretary of State shall not accept for filing any instrument authorized to be filed with the Secretary of State under this title in respect of any domestic corporation that is not in good standing or any foreign corporation that has ceased to be registered by reason of the neglect, refusal or failure to pay any such fee or tax, and shall not issue any certificate of good standing with respect to such domestic corporation or foreign corporation, unless and until such domestic corporation or foreign corporation shall have been restored to and have the status of a domestic corporation in good standing or a foreign corporation duly registered in this State."
        },
        {
          "number": "(j)",
          "content": "As used in this section, the term “exempt corporation” shall have the meaning given to it in § 501(b) of this title."
        }
      ]
    }
  ],
  "history": [
    "8 Del. C. 1953, § 391",
    "56 Del. Laws, c. 50",
    "56 Del. Laws, c. 186, § 31",
    "57 Del. Laws, c. 150, §§ 1-8",
    "57 Del. Laws, c. 421, § 14",
    "58 Del. Laws, c. 235, §§ 8, 9",
    "58 Del. Laws, c. 450, § 9",
    "59 Del. Laws, c. 106, § 18",
    "61 Del. Laws, c. 79, § 1",
    "62 Del. Laws, c. 356",
    "63 Del. Laws, c. 376, §§ 1, 2",
    "64 Del. Laws, c. 112, §§ 65-67",
    "64 Del. Laws, c. 317, § 4(a)-(h)",
    "64 Del. Laws, c. 321, § 4",
    "65 Del. Laws, c. 127, § 12",
    "65 Del. Laws, c. 234, § 2",
    "66 Del. Laws, c. 352, §§ 13, 14",
    "67 Del. Laws, c. 99, § 1",
    "67 Del. Laws, c. 190, §§ 11, 12",
    "67 Del. Laws, c. 229, §§ 2-11",
    "67 Del. Laws, c. 363, § 1",
    "68 Del. Laws, c. 163, §§ 3, 4",
    "68 Del. Laws, c. 246, §§ 1-3",
    "69 Del. Laws, c. 52, § 1",
    "69 Del. Laws, c. 221, §§ 2, 3",
    "69 Del. Laws, c. 245, § 1",
    "70 Del. Laws, c. 79, § 21",
    "70 Del. Laws, c. 186, § 1",
    "70 Del. Laws, c. 587, §§ 34, 35",
    "71 Del. Laws, c. 120, §§ 30, 31",
    "71 Del. Laws, c. 339, §§ 89-91",
    "72 Del. Laws, c. 123, § 12",
    "74 Del. Laws, c. 9, §§ 8, 9",
    "74 Del. Laws, c. 51, §§ 1-9",
    "74 Del. Laws, c. 118, § 2",
    "75 Del. Laws, c. 306, § 7",
    "76 Del. Laws, c. 286, § 1",
    "77 Del. Laws, c. 78, §§ 39-55",
    "77 Del. Laws, c. 253, § 67",
    "78 Del. Laws, c. 96, § 15",
    "78 Del. Laws, c. 273, § 12",
    "79 Del. Laws, c. 72, §§ 16-18",
    "79 Del. Laws, c. 122, § 11"
  ]
}
