{
  "jurisdiction": "US-DE",
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "III"
    },
    {
      "subdivision": "section",
      "number": "134"
    }
  ],
  "heading": "Change of address or name of registered agent",
  "content": [
    {
      "number": "(a)",
      "content": "A registered agent may change the address of the registered office of the corporation or corporations for which the agent is a registered agent to another address in this State by filing with the Secretary of State a certificate, executed and acknowledged by such registered agent, setting forth the address at which such registered agent has maintained the registered office for each of the corporations for which it is a registered agent, and further certifying to the new address to which each such registered office will be changed on a given day, and at which new address such registered agent will thereafter maintain the registered office for each of the corporations for which it is a registered agent. Thereafter, or until further change of address, as authorized by law, the registered office in this State of each of the corporations for which the agent is a registered agent shall be located at the new address of the registered agent thereof as given in the certificate."
    },
    {
      "number": "(b)",
      "content": "In the event of a change of name of any person or corporation acting as registered agent in this State, such registered agent shall file with the Secretary of State a certificate, executed and acknowledged by such registered agent, setting forth the new name of such registered agent, the name of such registered agent before it was changed, and the address at which such registered agent has maintained the registered office for each of the corporations for which it acts as a registered agent. A change of name of any person or corporation acting as a registered agent as a result of a merger or consolidation of the registered agent, with or into another person or corporation which succeeds to its assets by operation of law, shall be deemed a change of name for purposes of this section."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 134",
    "56 Del. Laws, c. 50",
    "64 Del. Laws, c. 112, § 4",
    "70 Del. Laws, c. 186, § 1",
    "70 Del. Laws, c. 587, § 9",
    "73 Del. Laws, c. 82, §§ 2, 3"
  ]
}
