{
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "XV"
    },
    {
      "subdivision": "section",
      "number": "363"
    }
  ],
  "heading": "Certain amendments and mergers; votes required; appraisal rights.",
  "content": [
    {
      "number": "(a)",
      "content": [
        {
          "type": "paragraph",
          "text": "Notwithstanding any other provisions of this chapter, a corporation that is not a public benefit corporation, may not, without the approval of 90% of the outstanding shares of each class of the stock of the corporation of which there are outstanding shares, whether voting or nonvoting:"
        },
        {
          "number": "(1)",
          "content": "Amend its certificate of incorporation to include a provision authorized by § 362(a)(1) of this title; or"
        },
        {
          "number": "(2)",
          "content": "Merge or consolidate with or into another entity if, as a result of such merger or consolidation, the shares in such corporation would become, or be converted into or exchanged for the right to receive, shares or other equity interests in a domestic or foreign public benefit corporation or similar entity."
        },
        {
          "type": "paragraph",
          "text": "The restrictions of this section shall not apply prior to the time that the corporation has received payment for any of its capital stock, or in the case of a nonstock corporation, prior to the time that it has members."
        }
      ]
    },
    {
      "number": "(b)",
      "content": [
        {
          "type": "paragraph",
          "text": "Any stockholder of a corporation that is not a public benefit corporation that holds shares of stock of such corporation immediately prior to the effective time of:"
        },
        {
          "number": "(1)",
          "content": "An amendment to the corporation’s certificate of incorporation to include a provision authorized by § 362(a)(1) of this title; or"
        },
        {
          "number": "(2)",
          "content": "A merger or consolidation that would result in the conversion of the corporation’s stock into or exchange of the corporation’s stock for the right to receive shares or other equity interests in a domestic or foreign public benefit corporation or similar entity;"
        },
        {
          "type": "paragraph",
          "text": "and has neither voted in favor of such amendment or such merger or consolidation nor consented thereto in writing pursuant to § 228 of this title, shall be entitled to an appraisal by the Court of Chancery of the fair value of the stockholder’s shares of stock."
        }
      ]
    },
    {
      "number": "(c)",
      "content": [
        {
          "type": "paragraph",
          "text": "Notwithstanding any other provisions of this chapter, a corporation that is a public benefit corporation may not, without the approval of 2/3 of the outstanding shares of each class of the stock of the corporation of which there are outstanding shares, whether voting or nonvoting:"
        },
        {
          "number": "(1)",
          "content": "Amend its certificate of incorporation to delete or amend a provision authorized by § 362(a)(1) or § 366(c) of this title; or"
        },
        {
          "number": "(2)",
          "content": "Merge or consolidate with or into another entity if, as a result of such merger or consolidation, the shares in such corporation would become, or be converted into or exchanged for the right to receive, shares or other equity interests in a domestic or foreign corporation that is not a public benefit corporation or similar entity and the certificate of incorporation (or similar governing instrument) of which does not contain the identical provisions identifying the public benefit or public benefits pursuant to § 362(a) of this title or imposing requirements pursuant to § 366(c) of this title."
        }
      ]
    },
    {
      "number": "(d)",
      "content": "Notwithstanding the foregoing, a nonprofit nonstock corporation may not be a constituent corporation to any merger or consolidation governed by this section."
    }
  ],
  "history": [
    "79 Del. Laws, c. 122, § 8"
  ]
}
