{
  "section": "102",
  "heading": "Contents of certificate of incorporation",
  "content": [
    {
      "number": "(a)",
      "content": [
        {
          "type": "paragraph",
          "text": "The certificate of incorporation shall set forth:"
        },
        {
          "number": "(1)",
          "content": "The name of the corporation, which (i) shall contain 1 of the words \"association,\" \"company,\" \"corporation,\" \"club,\" \"foundation,\" \"fund,\" \"incorporated,\" \"institute,\" \"society,\" \"union,\" \"syndicate,\" or \"limited,\" (or abbreviations thereof, with or without punctuation), or words (or abbreviations thereof, with or without punctuation) of like import of foreign countries or jurisdictions (provided they are written in roman characters or letters); provided, however, that the Division of Corporations in the Department of State may waive such requirement (unless it determines that such name is, or might otherwise appear to be, that of a natural person) if such corporation executes, acknowledges and files with the Secretary of State in accordance with § 103 of this title a certificate stating that its total assets, as defined in § 503(i) of this title, are not less than $10,000,000, or, in the sole discretion of the Division of Corporations in the Department of State, if the corporation is both a nonprofit nonstock corporation and an association of professionals, (ii) shall be such as to distinguish it upon the records in the office of the Division of Corporations in the Department of State from the names that are reserved on such records and from the names on such records of each other corporation, partnership, limited partnership, limited liability company or statutory trust organized or registered as a domestic or foreign corporation, partnership, limited partnership, limited liability company or statutory trust under the laws of this State, except with the written consent of the person who has reserved such name or such other foreign corporation or domestic or foreign partnership, limited partnership, limited liability company or statutory trust, executed, acknowledged and filed with the Secretary of State in accordance with § 103 of this title, (iii) except as permitted by § 395 of this title, shall not contain the word \"trust,\" and (iv) shall not contain the word \"bank,\" or any variation thereof, except for the name of a bank reporting to and under the supervision of the State Bank Commissioner of this State or a subsidiary of a bank or savings association (as those terms are defined in the Federal Deposit Insurance Act, as amended, at 12 U.S.C. § 1813), or a corporation regulated under the Bank Holding Company Act of 1956, as amended, 12 U.S.C. § 1841 et seq., or the Home Owners' Loan Act, as amended, 12 U.S.C. § 1461 et seq.; provided, however, that this section shall not be construed to prevent the use of the word \"bank,\" or any variation thereof, in a context clearly not purporting to refer to a banking business or otherwise likely to mislead the public about the nature of the business of the corporation or to lead to a pattern and practice of abuse that might cause harm to the interests of the public or the State as determined by the Division of Corporations in the Department of State;"
        },
        {
          "number": "(2)",
          "content": "The address (which shall be stated in accordance with § 131(c) of this title) of the corporation's registered office in this State, and the name of its registered agent at such address;"
        },
        {
          "number": "(3)",
          "content": "The nature of the business or purposes to be conducted or promoted. It shall be sufficient to state, either alone or with other businesses or purposes, that the purpose of the corporation is to engage in any lawful act or activity for which corporations may be organized under the General Corporation Law of Delaware, and by such statement all lawful acts and activities shall be within the purposes of the corporation, except for express limitations, if any;"
        },
        {
          "number": "(4)",
          "content": "If the corporation is to be authorized to issue only 1 class of stock, the total number of shares of stock which the corporation shall have authority to issue and the par value of each of such shares, or a statement that all such shares are to be without par value. If the corporation is to be authorized to issue more than 1 class of stock, the certificate of incorporation shall set forth the total number of shares of all classes of stock which the corporation shall have authority to issue and the number of shares of each class and shall specify each class the shares of which are to be without par value and each class the shares of which are to have par value and the par value of the shares of each such class. The certificate of incorporation shall also set forth a statement of the designations and the powers, preferences and rights, and the qualifications, limitations or restrictions thereof, which are permitted by § 151 of this title in respect of any class or classes of stock or any series of any class of stock of the corporation and the fixing of which by the certificate of incorporation is desired, and an express grant of such authority as it may then be desired to grant to the board of directors to fix by resolution or resolutions any thereof that may be desired but which shall not be fixed by the certificate of incorporation. The foregoing provisions of this paragraph shall not apply to nonstock corporations. In the case of nonstock corporations, the fact that they are not authorized to issue capital stock shall be stated in the certificate of incorporation. The conditions of membership, or other criteria for identifying members, of nonstock corporations shall likewise be stated in the certificate of incorporation or the bylaws. Nonstock corporations shall have members, but failure to have members shall not affect otherwise valid corporate acts or work a forfeiture or dissolution of the corporation. Nonstock corporations may provide for classes or groups of members having relative rights, powers and duties, and may make provision for the future creation of additional classes or groups of members having such relative rights, powers and duties as may from time to time be established, including rights, powers and duties senior to existing classes and groups of members. Except as otherwise provided in this chapter, nonstock corporations may also provide that any member or class or group of members shall have full, limited, or no voting rights or powers, including that any member or class or group of members shall have the right to vote on a specified transaction even if that member or class or group of members does not have the right to vote for the election of the members of the governing body of the corporation. Voting by members of a nonstock corporation may be on a per capita, number, financial interest, class, group, or any other basis set forth. The provisions referred to in the 3 preceding sentences may be set forth in the certificate of incorporation or the bylaws. If neither the certificate of incorporation nor the bylaws of a nonstock corporation state the conditions of membership, or other criteria for identifying members, the members of the corporation shall be deemed to be those entitled to vote for the election of the members of the governing body pursuant to the certificate of incorporation or bylaws of such corporation or otherwise until thereafter otherwise provided by the certificate of incorporation or the bylaws;"
        },
        {
          "number": "(5)",
          "content": "The name and mailing address of the incorporator or incorporators;"
        },
        {
          "number": "(6)",
          "content": "If the powers of the incorporator or incorporators are to terminate upon the filing of the certificate of incorporation, the names and mailing addresses of the persons who are to serve as directors until the first annual meeting of stockholders or until their successors are elected and qualify."
        }
      ]
    },
    {
      "number": "(b)",
      "content": [
        {
          "type": "paragraph",
          "text": "In addition to the matters required to be set forth in the certificate of incorporation by subsection (a) of this section, the certificate of incorporation may also contain any or all of the following matters:"
        },
        {
          "number": "(1)",
          "content": "Any provision for the management of the business and for the conduct of the affairs of the corporation, and any provision creating, defining, limiting and regulating the powers of the corporation, the directors, and the stockholders, or any class of the stockholders, or the governing body, members, or any class or group of members of a nonstock corporation; if such provisions are not contrary to the laws of this State. Any provision which is required or permitted by any section of this chapter to be stated in the bylaws may instead be stated in the certificate of incorporation;"
        },
        {
          "number": "(2)",
          "content": [
            {
              "type": "paragraph",
              "text": "The following provisions, in haec verba, (i), for a corporation other than a nonstock corporation, viz:"
            },
            {
              "type": "blockquote",
              "text": "\"Whenever a compromise or arrangement is proposed between this corporation and its creditors or any class of them and/or between this corporation and its stockholders or any class of them, any court of equitable jurisdiction within the State of Delaware may, on the application in a summary way of this corporation or of any creditor or stockholder thereof or on the application of any receiver or receivers appointed for this corporation under § 291 of Title 8 of the Delaware Code or on the application of trustees in dissolution or of any receiver or receivers appointed for this corporation under § 279 of Title 8 of the Delaware Code order a meeting of the creditors or class of creditors, and/or of the stockholders or class of stockholders of this corporation, as the case may be, to be summoned in such manner as the said court directs. If a majority in number representing three fourths in value of the creditors or class of creditors, and/or of the stockholders or class of stockholders of this corporation, as the case may be, agree to any compromise or arrangement and to any reorganization of this corporation as consequence of such compromise or arrangement, the said compromise or arrangement and the said reorganization shall, if sanctioned by the court to which the said application has been made, be binding on all the creditors or class of creditors, and/or on all the stockholders or class of stockholders, of this corporation, as the case may be, and also on this corporation\"; or"
            }
          ]
        },
        {
          "number": "(ii)",
          "content": [
            {
              "type": "paragraph",
              "text": ", for a nonstock corporation, viz:"
            },
            {
              "type": "blockquote",
              "text": "\"Whenever a compromise or arrangement is proposed between this corporation and its creditors or any class of them and/or between this corporation and its members or any class of them, any court of equitable jurisdiction within the State of Delaware may, on the application in a summary way of this corporation or of any creditor or member thereof or on the application of any receiver or receivers appointed for this corporation under § 291 of Title 8 of the Delaware Code or on the application of trustees in dissolution or of any receiver or receivers appointed for this corporation under § 279 of Title 8 of the Delaware Code order a meeting of the creditors or class of creditors, and/or of the members or class of members of this corporation, as the case may be, to be summoned in such manner as the said court directs. If a majority in number representing three fourths in value of the creditors or class of creditors, and/or of the members or class of members of this corporation, as the case may be, agree to any compromise or arrangement and to any reorganization of this corporation as consequence of such compromise or arrangement, the said compromise or arrangement and the said reorganization shall, if sanctioned by the court to which the said application has been made, be binding on all the creditors or class of creditors, and/or on all the members or class of members, of this corporation, as the case may be, and also on this corporation\";"
            }
          ]
        },
        {
          "number": "(3)",
          "content": "Such provisions as may be desired granting to the holders of the stock of the corporation, or the holders of any class or series of a class thereof, the preemptive right to subscribe to any or all additional issues of stock of the corporation of any or all classes or series thereof, or to any securities of the corporation convertible into such stock. No stockholder shall have any preemptive right to subscribe to an additional issue of stock or to any security convertible into such stock unless, and except to the extent that, such right is expressly granted to such stockholder in the certificate of incorporation. All such rights in existence on July 3, 1967, shall remain in existence unaffected by this paragraph unless and until changed or terminated by appropriate action which expressly provides for the change or termination;"
        },
        {
          "number": "(4)",
          "content": "Provisions requiring for any corporate action, the vote of a larger portion of the stock or of any class or series thereof, or of any other securities having voting power, or a larger number of the directors, than is required by this chapter;"
        },
        {
          "number": "(5)",
          "content": "A provision limiting the duration of the corporation's existence to a specified date; otherwise, the corporation shall have perpetual existence;"
        },
        {
          "number": "(6)",
          "content": "A provision imposing personal liability for the debts of the corporation on its stockholders to a specified extent and upon specified conditions; otherwise, the stockholders of a corporation shall not be personally liable for the payment of the corporation's debts except as they may be liable by reason of their own conduct or acts;"
        },
        {
          "number": "(7)",
          "content": "A provision eliminating or limiting the personal liability of a director to the corporation or its stockholders for monetary damages for breach of fiduciary duty as a director, provided that such provision shall not eliminate or limit the liability of a director: (i) For any breach of the director's duty of loyalty to the corporation or its stockholders; (ii) for acts or omissions not in good faith or which involve intentional misconduct or a knowing violation of law; (iii) under § 174 of this title; or (iv) for any transaction from which the director derived an improper personal benefit. No such provision shall eliminate or limit the liability of a director for any act or omission occurring prior to the date when such provision becomes effective. All references in this paragraph to a director shall also be deemed to refer to such other person or persons, if any, who, pursuant to a provision of the certificate of incorporation in accordance with § 141(a) of this title, exercise or perform any of the powers or duties otherwise conferred or imposed upon the board of directors by this title."
        }
      ]
    },
    {
      "number": "(c)",
      "content": "It shall not be necessary to set forth in the certificate of incorporation any of the powers conferred on corporations by this chapter."
    },
    {
      "number": "(d)",
      "content": "Except for provisions included pursuant to paragraphs (a)(1), (a)(2), (a)(5), (a)(6), (b)(2), (b)(5), (b)(7) of this section, and provisions included pursuant to paragraph (a)(4) of this section specifying the classes, number of shares, and par value of shares a corporation other than a nonstock corporation is authorized to issue, any provision of the certificate of incorporation may be made dependent upon facts ascertainable outside such instrument, provided that the manner in which such facts shall operate upon the provision is clearly and explicitly set forth therein. The term \"facts,\" as used in this subsection, includes, but is not limited to, the occurrence of any event, including a determination or action by any person or body, including the corporation."
    },
    {
      "number": "(e)",
      "content": [
        {
          "type": "paragraph",
          "text": "The exclusive right to the use of a name that is available for use by a domestic or foreign corporation may be reserved by or on behalf of:"
        },
        {
          "number": "(1)",
          "content": "Any person intending to incorporate or organize a corporation with that name under this chapter or contemplating such incorporation or organization;"
        },
        {
          "number": "(2)",
          "content": "Any domestic corporation or any foreign corporation qualified to do business in the State of Delaware, in either case, intending to change its name or contemplating such a change;"
        },
        {
          "number": "(3)",
          "content": "Any foreign corporation intending to qualify to do business in the State of Delaware and adopt that name or contemplating such qualification and adoption; and"
        },
        {
          "number": "(4)",
          "content": "Any person intending to organize a foreign corporation and have it qualify to do business in the State of Delaware and adopt that name or contemplating such organization, qualification and adoption."
        },
        {
          "type": "paragraph",
          "text": "The reservation of a specified name may be made by filing with the Secretary of State an application, executed by the applicant, certifying that the reservation is made by or on behalf of a domestic corporation, foreign corporation or other person described in paragraphs (e)(1)-(4) of this section above, and specifying the name to be reserved and the name and address of the applicant. If the Secretary of State finds that the name is available for use by a domestic or foreign corporation, the Secretary shall reserve the name for the use of the applicant for a period of 120 days. The same applicant may renew for successive 120-day periods a reservation of a specified name by filing with the Secretary of State, prior to the expiration of such reservation (or renewal thereof), an application for renewal of such reservation, executed by the applicant, certifying that the reservation is renewed by or on behalf of a domestic corporation, foreign corporation or other person described in paragraphs (e)(1)-(4) of this section above and specifying the name reservation to be renewed and the name and address of the applicant. The right to the exclusive use of a reserved name may be transferred to any other person by filing in the office of the Secretary of State a notice of the transfer, executed by the applicant for whom the name was reserved, specifying the name reservation to be transferred and the name and address of the transferee. The reservation of a specified name may be cancelled by filing with the Secretary of State a notice of cancellation, executed by the applicant or transferee, specifying the name reservation to be cancelled and the name and address of the applicant or transferee. Unless the Secretary of State finds that any application, application for renewal, notice of transfer, or notice of cancellation filed with the Secretary of State as required by this subsection does not conform to law, upon receipt of all filing fees required by law the Secretary of State shall prepare and return to the person who filed such instrument a copy of the filed instrument with a notation thereon of the action taken by the Secretary of State. A fee as set forth in § 391 of this title shall be paid at the time of the reservation of any name, at the time of the renewal of any such reservation and at the time of the filing of a notice of the transfer or cancellation of any such reservation."
        }
      ]
    }
  ],
  "history": [
    "8 Del. C. 1953, § 102",
    "56 Del. Laws, c. 50",
    "57 Del. Laws, c. 148, § 1",
    "65 Del. Laws, c. 127, § 1",
    "65 Del. Laws, c. 289, §§ 1, 2",
    "66 Del. Laws, c. 136, § 1",
    "66 Del. Laws, c. 352, § 1",
    "67 Del. Laws, c. 376, § 1",
    "69 Del. Laws, c. 61, § 1",
    "70 Del. Laws, c. 79, §§ 1-3",
    "71 Del. Laws, c. 120, § 1",
    "71 Del. Laws, c. 339, § 2",
    "72 Del. Laws, c. 123, § 1",
    "72 Del. Laws, c. 343, § 1",
    "73 Del. Laws, c. 82, § 1",
    "73 Del. Laws, c. 329, § 43",
    "74 Del. Laws, c. 326, § 1",
    "75 Del. Laws, c. 306, §§ 1, 2",
    "77 Del. Laws, c. 253, §§ 1-7",
    "78 Del. Laws, c. 96, §§ 1-3"
  ]
}
