{
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "IX"
    },
    {
      "subdivision": "section",
      "number": "263"
    }
  ],
  "heading": "Merger or consolidation of domestic corporations and partnerships.",
  "content": [
    {
      "number": "(a)",
      "content": "Any 1 or more corporations of this State may merge or consolidate with 1 or more partnerships (whether general (including a limited liability partnership) or limited (including a limited liability limited partnership)), of this State or of any other state or states of the United States, or of the District of Columbia, unless the laws of such other state or states or the District of Columbia forbid such merger or consolidation. Such corporation or corporations and such 1 or more partnerships may merge with or into a corporation, which may be any 1 of such corporations, or they may merge with or into a partnership, which may be any 1 of such partnerships, or they may consolidate into a new corporation or partnership formed by the consolidation, which shall be a corporation or partnership of this State or any other state of the United States, or the District of Columbia, which permits such merger or consolidation, pursuant to an agreement of merger or consolidation, as the case may be, complying and approved in accordance with this section."
    },
    {
      "number": "(b)",
      "content": [
        {
          "type": "paragraph",
          "text": "Each such corporation and partnership shall enter into a written agreement of merger or consolidation. The agreement shall state:"
        },
        {
          "number": "(1)",
          "content": "The terms and conditions of the merger or consolidation;"
        },
        {
          "number": "(2)",
          "content": "The mode of carrying the same into effect;"
        },
        {
          "number": "(3)",
          "content": "The manner, if any, of converting the shares of stock of each such corporation and the partnership interests of each such partnership into shares, partnership interests or other securities of the entity surviving or resulting from such merger or consolidation or of cancelling some or all of such shares or interests, and if any shares of any such corporation or any partnership interests of any such partnership are not to remain outstanding, to be converted solely into shares, partnership interests or other securities of the entity surviving or resulting from such merger or consolidation or to be cancelled, the cash, property, rights or securities of any other corporation or entity which the holders of such shares or partnership interests are to receive in exchange for, or upon conversion of such shares or partnership interests and the surrender of any certificates evidencing them, which cash, property, rights or securities of any other corporation or entity may be in addition to or in lieu of shares, partnership interests or other securities of the entity surviving or resulting from such merger or consolidation; and"
        },
        {
          "number": "(4)",
          "content": "Such other details or provisions as are deemed desirable, including, without limiting the generality of the foregoing, a provision for the payment of cash in lieu of the issuance of fractional shares or interests of the surviving or resulting corporation or partnership."
        },
        {
          "type": "paragraph",
          "text": "Any of the terms of the agreement of merger or consolidation may be made dependent upon facts ascertainable outside of such agreement, provided that the manner in which such facts shall operate upon the terms of the agreement is clearly and expressly set forth in the agreement of merger or consolidation. The term “facts,” as used in the preceding sentence, includes, but is not limited to, the occurrence of any event, including a determination or action by any person or body, including the corporation."
        }
      ]
    },
    {
      "number": "(c)",
      "content": [
        {
          "type": "paragraph",
          "text": "The agreement required by subsection (b) of this section shall be adopted, approved, certified, executed and acknowledged by each of the corporations in the same manner as is provided in § 251 or § 255 of this title and, in the case of the partnerships, in accordance with their partnership agreements and in accordance with the laws of the state under which they are formed, as the case may be. If the surviving or resulting entity is a partnership, in addition to any other approvals, each stockholder of a merging corporation who will become a general partner of the surviving or resulting partnership must approve the agreement of merger or consolidation. The agreement shall be filed and shall become effective for all purposes of the laws of this State when and as provided in § 251 or § 255 of this title with respect to the merger or consolidation of corporations of this State. In lieu of filing the agreement of merger or consolidation, the surviving or resulting corporation or partnership may file a certificate of merger or consolidation, executed in accordance with § 103 of this title, if the surviving or resulting entity is a corporation, or by a general partner, if the surviving or resulting entity is a partnership, which states:"
        },
        {
          "number": "(1)",
          "content": "The name, state of domicile and type of entity of each of the constituent entities;"
        },
        {
          "number": "(2)",
          "content": "That an agreement of merger or consolidation has been approved, adopted, certified, executed and acknowledged by each of the constituent entities in accordance with this subsection;"
        },
        {
          "number": "(3)",
          "content": "The name of the surviving or resulting corporation or partnership;"
        },
        {
          "number": "(4)",
          "content": "In the case of a merger in which a corporation is the surviving entity, such amendments or changes in the certificate of incorporation of the surviving corporation as are desired to be effected by the merger (which amendments or changes may amend and restate the certificate of incorporation of the surviving corporation in its entirety), or, if no such amendments or changes are desired, a statement that the certificate of incorporation of the surviving corporation shall be its certificate of incorporation;"
        },
        {
          "number": "(5)",
          "content": "In the case of a consolidation in which a corporation is the resulting entity, that the certificate of incorporation of the resulting corporation shall be as is set forth in an attachment to the certificate;"
        },
        {
          "number": "(6)",
          "content": "That the executed agreement of consolidation or merger is on file at an office of the surviving corporation or partnership and the address thereof;"
        },
        {
          "number": "(7)",
          "content": "That a copy of the agreement of consolidation or merger will be furnished by the surviving or resulting entity, on request and without cost, to any stockholder of any constituent corporation or any partner of any constituent partnership; and"
        },
        {
          "number": "(8)",
          "content": "The agreement, if any, required by subsection (d) of this section."
        }
      ]
    },
    {
      "number": "(d)",
      "content": "If the entity surviving or resulting from the merger or consolidation is to be governed by the laws of the District of Columbia or any state other than this State, it shall agree that it may be served with process in this State in any proceeding for enforcement of any obligation of any constituent corporation or partnership of this State, as well as for enforcement of any obligation of the surviving or resulting corporation or partnership arising from the merger or consolidation, including any suit or other proceeding to enforce the right of any stockholders as determined in appraisal proceedings pursuant to § 262 of this title, and shall irrevocably appoint the Secretary of State as its agent to accept service of process in any such suit or other proceedings and shall specify the address to which a copy of such process shall be mailed by the Secretary of State. Process may be served upon the Secretary of State under this subsection by means of electronic transmission but only as prescribed by the Secretary of State. The Secretary of State is authorized to issue such rules and regulations with respect to such service as the Secretary of State deems necessary or appropriate. In the event of such service upon the Secretary of State in accordance with this subsection, the Secretary of State shall forthwith notify such surviving or resulting corporation or partnership thereof by letter, directed to such surviving or resulting corporation or partnership at its address so specified, unless such surviving or resulting corporation or partnership shall have designated in writing to the Secretary of State a different address for such purpose, in which case it shall be mailed to the last address so designated. Such letter shall be sent by a mail or courier service that includes a record of mailing or deposit with the courier and a record of delivery evidenced by the signature of the recipient. Such letter shall enclose a copy of the process and any other papers served on the Secretary of State pursuant to this subsection. It shall be the duty of the plaintiff in the event of such service to serve process and any other papers in duplicate, to notify the Secretary of State that service is being effected pursuant to this subsection and to pay the Secretary of State the sum of $50 for the use of the State, which sum shall be taxed as part of the costs in the proceeding, if the plaintiff shall prevail therein. The Secretary of State shall maintain an alphabetical record of any such service setting forth the name of the plaintiff and the defendant, the title, docket number and nature of the proceeding in which process has been served upon the Secretary of State, the fact that service has been effected pursuant to this subsection, the return date thereof, and the day and hour service was made. The Secretary of State shall not be required to retain such information longer than 5 years from receipt of the service of process."
    },
    {
      "number": "(e)",
      "content": "Sections 251(d)-(f), 255(c) (second sentence) and (d)-(f), 259-261 and 328 of this title shall, insofar as they are applicable, apply to mergers or consolidations between corporations and partnerships."
    },
    {
      "number": "(f)",
      "content": "Nothing in this section shall be deemed to authorize the merger of a charitable nonstock corporation into a partnership, if the charitable status of such nonstock corporation would thereby be lost or impaired; but a partnership may be merged into a charitable nonstock corporation which shall continue as the surviving corporation."
    }
  ],
  "history": [
    "66 Del. Laws, c. 352, § 10",
    "67 Del. Laws, c. 190, § 6",
    "70 Del. Laws, c. 349, §§ 15, 20",
    "70 Del. Laws, c. 587, § 25",
    "71 Del. Laws, c. 339, §§ 53, 54",
    "73 Del. Laws, c. 82, §§ 22-26",
    "73 Del. Laws, c. 298, § 10",
    "74 Del. Laws, c. 84, § 18",
    "77 Del. Laws, c. 253, §§ 51-53",
    "77 Del. Laws, c. 290, §§ 18, 19",
    "78 Del. Laws, c. 273, § 2",
    "79 Del. Laws, c. 72, § 12.;"
  ]
}
