{
  "jurisdiction": "US-DE",
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "I"
    },
    {
      "subdivision": "section",
      "number": "109"
    }
  ],
  "heading": "Bylaws",
  "content": [
    {
      "number": "(a)",
      "content": "The original or other bylaws of a corporation may be adopted, amended or repealed by the incorporators, by the initial directors of a corporation other than a nonstock corporation or initial members of the governing body of a nonstock corporation if they were named in the certificate of incorporation, or, before a corporation other than a nonstock corporation has received any payment for any of its stock, by its board of directors. After a corporation other than a nonstock corporation has received any payment for any of its stock, the power to adopt, amend or repeal bylaws shall be in the stockholders entitled to vote. In the case of a nonstock corporation, the power to adopt, amend or repeal bylaws shall be in its members entitled to vote. Notwithstanding the foregoing, any corporation may, in its certificate of incorporation, confer the power to adopt, amend or repeal bylaws upon the directors or, in the case of a nonstock corporation, upon its governing body. The fact that such power has been so conferred upon the directors or governing body, as the case may be, shall not divest the stockholders or members of the power, nor limit their power to adopt, amend or repeal bylaws."
    },
    {
      "number": "(b)",
      "content": "The bylaws may contain any provision, not inconsistent with law or with the certificate of incorporation, relating to the business of the corporation, the conduct of its affairs, and its rights or powers or the rights or powers of its stockholders, directors, officers or employees."
    }
  ],
  "history": [
    "8 Del. C. 1953, ยง 109",
    "56 Del. Laws, c. 50",
    "59 Del. Laws, c. 437, ยง 1",
    "77 Del. Laws, c. 253, ยง 8"
  ]
}
