{
  "jurisdiction": "US-DE",
  "provision": [
    {
      "subdivision": "code",
      "number": "Delaware Code"
    },
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "IX"
    },
    {
      "subdivision": "section",
      "number": "254"
    }
  ],
  "heading": "Merger or consolidation of domestic corporation and joint-stock or other association",
  "content": [
    {
      "number": "(a)",
      "content": "The term “joint-stock association” as used in this section, includes any association of the kind commonly known as a joint-stock association or joint-stock company and any unincorporated association, trust or enterprise having members or having outstanding shares of stock or other evidences of financial or beneficial interest therein, whether formed by agreement or under statutory authority or otherwise, but does not include a corporation, partnership or limited liability company. The term “stockholder” as used in this section, includes every member of such joint-stock association or holder of a share of stock or other evidence of financial or beneficial interest therein."
    },
    {
      "number": "(b)",
      "content": "Any 1 or more corporations of this State may merge or consolidate with 1 or more joint-stock associations, except a joint-stock association formed under the laws of a state which forbids such merger or consolidation. Such corporation or corporations and such 1 or more joint-stock associations may merge into a single corporation, or joint-stock association, which may be any one of such corporations or joint-stock associations, or they may consolidate into a new corporation or joint-stock association of this State, pursuant to an agreement of merger or consolidation, as the case may be, complying and approved in accordance with this section. The surviving or resulting entity may be organized for profit or not organized for profit, and if the surviving or resulting entity is a corporation, it may be a stock corporation or a nonstock corporation."
    },
    {
      "number": "(c)",
      "content": [
        {
          "type": "paragraph",
          "text": "Each such corporation and joint-stock association shall enter into a written agreement of merger or consolidation. The agreement shall state:"
        },
        {
          "number": "(1)",
          "content": "The terms and conditions of the merger or consolidation;"
        },
        {
          "number": "(2)",
          "content": "The mode of carrying the same into effect;"
        },
        {
          "number": "(3)",
          "content": "The manner, if any, of converting the shares of stock of each stock corporation, the interest of members of each nonstock corporation, and the shares, membership or financial or beneficial interests in each of the joint-stock associations into shares or other securities of a stock corporation or membership interests of a nonstock corporation or into shares, memberships or financial or beneficial interests of the joint-stock association surviving or resulting from such merger or consolidation, or of cancelling some or all of such shares, memberships or financial or beneficial interests, and, if any shares of any such stock corporation, any membership interests of any such nonstock corporation or any shares, memberships or financial or beneficial interests in any such joint-stock association are not to remain outstanding, to be converted solely into shares or other securities of the stock corporation or membership interests of the nonstock corporation or into shares, memberships or financial or beneficial interests of the joint-stock association surviving or resulting from such merger or consolidation or to be cancelled, the cash, property, rights or securities of any other corporation or entity which the holders of shares of any such stock corporation, membership interests of any such nonstock corporation, or shares, memberships or financial or beneficial interests of any such joint-stock association are to receive in exchange for, or upon conversion of such shares, membership interests or shares, memberships or financial or beneficial interests, and the surrender of any certificates evidencing them, which cash, property, rights or securities of any other corporation or entity may be in addition to or in lieu of shares or other securities of the stock corporation or membership interests of the nonstock corporation or shares, memberships or financial or beneficial interests of the joint-stock association surviving or resulting from such merger or consolidation; and"
        },
        {
          "number": "(4)",
          "content": "Such other details or provisions as are deemed desirable, including, without limiting the generality of the foregoing, a provision for the payment of cash in lieu of the issuance of fractional shares where the surviving or resulting entity is a corporation."
        },
        {
          "type": "paragraph",
          "text": "There shall also be set forth in the agreement such other matters or provisions as shall then be required to be set forth in certificates of incorporation or documents required to establish and maintain a joint-stock association by the laws of this State and that can be stated in the case of such merger or consolidation. Any of the terms of the agreement of merger or consolidation may be made dependent upon facts ascertainable outside of such agreement, provided that the manner in which such facts shall operate upon the terms of the agreement is clearly and expressly set forth in the agreement of merger or consolidation. The term “facts,” as used in the preceding sentence, includes, but is not limited to, the occurrence of any event, including a determination or action by any person or body, including the corporation."
        }
      ]
    },
    {
      "number": "(d)",
      "content": [
        {
          "type": "paragraph",
          "text": "The agreement required by subsection (c) of this section shall be adopted, approved, certified, executed and acknowledged by each of the stock or nonstock corporations in the same manner as is provided in § 251 or § 255 of this title, respectively, and in the case of the joint-stock associations in accordance with their articles of association or other instrument containing the provisions by which they are organized or regulated or in accordance with the laws of the state under which they are formed, as the case may be. Where the surviving or resulting entity is a corporation, the agreement shall be filed and shall become effective for all purposes of the laws of this State when and as provided in § 251 of this title with respect to the merger or consolidation of corporations of this State. In lieu of filing the agreement of merger or consolidation, where the surviving or resulting entity is a corporation it may file a certificate of merger or consolidation, executed in accordance with § 103 of this title, which states:"
        },
        {
          "number": "(1)",
          "content": "The name, state of domicile and type of entity of each of the constituent entities;"
        },
        {
          "number": "(2)",
          "content": "That an agreement of merger or consolidation has been approved, adopted, certified, executed and acknowledged by each of the constituent entities in accordance with this subsection;"
        },
        {
          "number": "(3)",
          "content": "The name of the surviving or resulting corporation;"
        },
        {
          "number": "(4)",
          "content": "In the case of a merger, such amendments or changes in the certificate of incorporation of the surviving corporation as are desired to be effected by the merger (which amendments or changes may amend and restate the certificate of incorporation of the surviving corporation in its entirety), or, if no such amendments or changes are desired, a statement that the certificate of incorporation of the surviving corporation shall be its certificate of incorporation;"
        },
        {
          "number": "(5)",
          "content": "In the case of a consolidation, that the certificate of incorporation of the resulting corporation shall be as is set forth in an attachment to the certificate;"
        },
        {
          "number": "(6)",
          "content": "That the executed agreement of consolidation or merger is on file at an office of the surviving corporation and the address thereof; and"
        },
        {
          "number": "(7)",
          "content": "That a copy of the agreement of consolidation or merger will be furnished by the surviving corporation, on request and without cost, to any stockholder of any constituent entity."
        },
        {
          "type": "paragraph",
          "text": "Where the surviving or resulting entity is a joint-stock association, the agreement shall be filed and shall be effective for all purposes when filed in accordance with the laws regulating the creation of joint-stock associations."
        }
      ]
    },
    {
      "number": "(e)",
      "content": "Sections 251(d), 251(e), 251(f), 252(d), 259 through 262 and 328 of this title shall, insofar as they are applicable, apply to mergers or consolidations between corporations and joint-stock associations; the word “corporation” where applicable, as used in those sections, being deemed to include joint-stock associations as defined herein. Where the surviving or resulting entity is a corporation, the personal liability, if any, of any stockholder of a joint-stock association existing at the time of such merger or consolidation shall not thereby be extinguished, shall remain personal to such stockholder and shall not become the liability of any subsequent transferee of any share of stock in such surviving or resulting corporation or of any other stockholder of such surviving or resulting corporation."
    },
    {
      "number": "(f)",
      "content": "Nothing in this section shall be deemed to authorize the merger of a charitable nonstock corporation or charitable joint-stock association into a stock corporation or joint-stock association if the charitable status of such nonstock corporation or joint-stock association would be thereby lost or impaired, but a stock corporation or joint-stock association may be merged into a charitable nonstock corporation or charitable joint-stock association which shall continue as the surviving corporation or joint-stock association."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 254",
    "56 Del. Laws, c. 50",
    "57 Del. Laws, c. 421, § 10",
    "59 Del. Laws, c. 437, §§ 17, 18",
    "64 Del. Laws, c. 112, § 38",
    "66 Del. Laws, c. 136, §§ 27, 28",
    "66 Del. Laws, c. 352, §§ 4-6",
    "67 Del. Laws, c. 376, §§ 13-17",
    "69 Del. Laws, c. 61, § 9",
    "70 Del. Laws, c. 349, §§ 11, 19",
    "70 Del. Laws, c. 587, § 21",
    "71 Del. Laws, c. 120, § 14",
    "71 Del. Laws, c. 339, § 46",
    "74 Del. Laws, c. 84, § 14",
    "77 Del. Laws, c. 290, § 14",
    "78 Del. Laws, c. 273, § 1",
    "79 Del. Laws, c. 72, § 8"
  ]
}
