{
  "jurisdiction": "US-DE",
  "provision": [
    {
      "subdivision": "code",
      "number": "Delaware Code"
    },
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "IX"
    },
    {
      "subdivision": "section",
      "number": "255"
    }
  ],
  "heading": "Merger or consolidation of domestic nonstock corporations",
  "content": [
    {
      "number": "(a)",
      "content": "Any 2 or more nonstock corporations of this State, whether or not organized for profit, may merge into a single corporation, which may be any 1 of the constituent corporations, or they may consolidate into a new nonstock corporation, whether or not organized for profit, formed by the consolidation, pursuant to an agreement of merger or consolidation, as the case may be, complying and approved in accordance with this section."
    },
    {
      "number": "(b)",
      "content": [
        {
          "type": "paragraph",
          "text": "Subject to subsection (d) of this section, the governing body of each corporation which desires to merge or consolidate shall adopt a resolution approving an agreement of merger or consolidation. The agreement shall state:"
        },
        {
          "number": "(1)",
          "content": "The terms and conditions of the merger or consolidation;"
        },
        {
          "number": "(2)",
          "content": "The mode of carrying the same into effect;"
        },
        {
          "number": "(3)",
          "content": "Such other provisions or facts required or permitted by this chapter to be stated in a certificate of incorporation for nonstock corporations as can be stated in the case of a merger or consolidation, stated in such altered form as the circumstances of the case require;"
        },
        {
          "number": "(4)",
          "content": "The manner, if any, of converting the memberships or membership interests of each of the constituent corporations into memberships or membership interests of the corporation surviving or resulting from the merger or consolidation, or of cancelling some or all of such memberships or membership interests; and"
        },
        {
          "number": "(5)",
          "content": "Such other details or provisions as are deemed desirable."
        },
        {
          "type": "paragraph",
          "text": "The agreement so adopted shall be executed and acknowledged in accordance with § 103 of this title. Any of the terms of the agreement of merger or consolidation may be made dependent upon facts ascertainable outside of such agreement, provided that the manner in which such facts shall operate upon the terms of the agreement is clearly and expressly set forth in the agreement of merger or consolidation. The term “facts,” as used in the preceding sentence, includes, but is not limited to, the occurrence of any event, including a determination or action by any person or body, including the corporation."
        }
      ]
    },
    {
      "number": "(c)",
      "content": "Subject to subsection (d) of this section, the agreement shall be submitted to the members of each constituent corporation, at an annual or special meeting thereof for the purpose of acting on the agreement. Due notice of the time, place and purpose of the meeting shall be mailed to each member of each such corporation who has the right to vote for the election of the members of the governing body of the corporation and to each other member who is entitled to vote on the merger under the certificate of incorporation or the bylaws of such corporation, at the member’s address as it appears on the records of the corporation, at least 20 days prior to the date of the meeting. The notice shall contain a copy of the agreement or a brief summary thereof. At the meeting the agreement shall be considered and a vote, in person or by proxy, taken for the adoption or rejection of the agreement. If the agreement is adopted by a majority of the members of each such corporation entitled to vote for the election of the members of the governing body of the corporation and any other members entitled to vote on the merger under the certificate of incorporation or the bylaws of such corporation, then that fact shall be certified on the agreement by the officer of each such corporation performing the duties ordinarily performed by the secretary or assistant secretary of a corporation, provided that such certification on the agreement shall not be required if a certificate of merger or consolidation is filed in lieu of filing the agreement. If the agreement shall be adopted and certified by each constituent corporation in accordance with this section, it shall be filed and shall become effective in accordance with § 103 of this title. The provisions set forth in the last sentence of § 251(c) of this title shall apply to a merger under this section, and the reference therein to “stockholder” shall be deemed to include “member” hereunder."
    },
    {
      "number": "(d)",
      "content": "Notwithstanding subsection (b) or (c) of this section, if, under the certificate of incorporation or the bylaws of any 1 or more of the constituent corporations, there shall be no members who have the right to vote for the election of the members of the governing body of the corporation, or for the merger, other than the members of the governing body themselves, no further action by the governing body or the members of such corporation shall be necessary if the resolution approving an agreement of merger or consolidation has been adopted by a majority of all the members of the governing body thereof, and that fact shall be certified on the agreement in the same manner as is provided in the case of the adoption of the agreement by the vote of the members of a corporation, provided that such certification on the agreement shall not be required if a certificate of merger or consolidation is filed in lieu of filing the agreement, and thereafter the same procedure shall be followed to consummate the merger or consolidation."
    },
    {
      "number": "(e)",
      "content": "Section 251(d) of this title shall apply to a merger under this section; provided, however, that references to the board of directors, to stockholders, and to shares of a constituent corporation shall be deemed to be references to the governing body of the corporation, to members of the corporation, and to memberships or membership interests, as applicable, respectively."
    },
    {
      "number": "(f)",
      "content": "Section 251(e) of this title shall apply to a merger under this section."
    },
    {
      "number": "(g)",
      "content": "Nothing in this section shall be deemed to authorize the merger of a charitable nonstock corporation into a nonstock corporation if such charitable nonstock corporation would thereby have its charitable status lost or impaired; but a nonstock corporation may be merged into a charitable nonstock corporation which shall continue as the surviving corporation."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 255",
    "56 Del. Laws, c. 50",
    "56 Del. Laws, c. 186, § 19",
    "58 Del. Laws, c. 235, § 6",
    "59 Del. Laws, c. 437, §§ 19, 20",
    "64 Del. Laws, c. 112, §§ 39-41",
    "66 Del. Laws, c. 136, § 29",
    "70 Del. Laws, c. 349, § 12",
    "70 Del. Laws, c. 186, § 1",
    "70 Del. Laws, c. 587, § 22",
    "72 Del. Laws, c. 123, § 9",
    "74 Del. Laws, c. 84, § 15",
    "76 Del. Laws, c. 145, §§ 8, 9",
    "77 Del. Laws, c. 253, § 41"
  ]
}
