{
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "IX"
    },
    {
      "subdivision": "section",
      "number": "256"
    }
  ],
  "heading": "Merger or consolidation of domestic and foreign nonstock corporations; service of process upon surviving or resulting corporation",
  "content": [
    {
      "number": "(a)",
      "content": "Any 1 or more nonstock corporations of this State may merge or consolidate with 1 or more other nonstock corporations of any other state or states of the United States, or of the District of Columbia if the laws of such other state or states or of the District permit a corporation of such jurisdiction to merge with a corporation of another jurisdiction. The constituent corporations may merge into a single corporation, which may be any 1 of the constituent corporations, or they may consolidate into a new nonstock corporation formed by the consolidation, which may be a corporation of the state of incorporation of any 1 of the constituent corporations, pursuant to an agreement of merger or consolidation, as the case may be, complying and approved in accordance with this section. In addition, any 1 or more nonstock corporations organized under the laws of any jurisdiction other than 1 of the United States may merge or consolidate with 1 or more nonstock corporations of this State if the surviving or resulting corporation will be a corporation of this State, and if the laws under which the other corporation or corporations are formed permit a corporation of such jurisdiction to merge with a corporation of another jurisdiction."
    },
    {
      "number": "(b)",
      "content": [
        {
          "type": "paragraph",
          "text": "All the constituent corporations shall enter into an agreement of merger or consolidation. The agreement shall state:"
        },
        {
          "number": "(1)",
          "content": "The terms and conditions of the merger or consolidation;"
        },
        {
          "number": "(2)",
          "content": "The mode of carrying the same into effect;"
        },
        {
          "number": "(3)",
          "content": "The manner, if any, of converting the memberships or membership interests of each of the constituent corporations into memberships or membership interests of the corporation surviving or resulting from such merger or consolidation or of cancelling some or all of such memberships or membership interests;"
        },
        {
          "number": "(4)",
          "content": "Such other details and provisions as shall be deemed desirable; and"
        },
        {
          "number": "(5)",
          "content": "Such other provisions or facts as shall then be required to be stated in a certificate of incorporation by the laws of the state which are stated in the agreement to be the laws that shall govern the surviving or resulting corporation and that can be stated in the case of a merger or consolidation."
        },
        {
          "type": "paragraph",
          "text": "Any of the terms of the agreement of merger or consolidation may be made dependent upon facts ascertainable outside of such agreement, provided that the manner in which such facts shall operate upon the terms of the agreement is clearly and expressly set forth in the agreement of merger or consolidation. The term “facts,” as used in the preceding sentence, includes, but is not limited to, the occurrence of any event, including a determination or action by any person or body, including the corporation."
        }
      ]
    },
    {
      "number": "(c)",
      "content": "The agreement shall be adopted, approved, certified, executed and acknowledged by each of the constituent corporations in accordance with the laws under which it is formed and, in the case of a Delaware corporation, in the same manner as is provided in § 255 of this title. The agreement shall be filed and shall become effective for all purposes of the laws of this State when and as provided in § 255 of this title with respect to the merger of nonstock corporations of this State. Insofar as they may be applicable, the provisions set forth in the last sentence of § 252(c) of this title shall apply to a merger under this section, and the reference therein to “stockholder” shall be deemed to include “member” hereunder."
    },
    {
      "number": "(d)",
      "content": "If the corporation surviving or resulting from the merger or consolidation is to be governed by the laws of any state other than this State, it shall agree that it may be served with process in this State in any proceeding for enforcement of any obligation of any constituent corporation of this State, as well as for enforcement of any obligation of the surviving or resulting corporation arising from the merger or consolidation and shall irrevocably appoint the Secretary of State as its agent to accept service of process in any suit or other proceedings and shall specify the address to which a copy of such process shall be mailed by the Secretary of State. Process may be served upon the Secretary of State under this subsection by means of electronic transmission but only as prescribed by the Secretary of State. The Secretary of State is authorized to issue such rules and regulations with respect to such service as the Secretary of State deems necessary or appropriate. In the event of such service upon the Secretary of State in accordance with this subsection, the Secretary of State shall forthwith notify such surviving or resulting corporation thereof by letter, directed to such corporation at its address so specified, unless such surviving or resulting corporation shall have designated in writing to the Secretary of State a different address for such purpose, in which case it shall be mailed to the last address so designated. Such letter shall be sent by a mail or courier service that includes a record of mailing or deposit with the courier and a record of delivery evidenced by the signature of the recipient. Such letter shall enclose a copy of the process and any other papers served upon the Secretary of State. It shall be the duty of the plaintiff in the event of such service to serve process and any other papers in duplicate, to notify the Secretary of State that service is being made pursuant to this subsection, and to pay the Secretary of State the sum of $50 for the use of the State, which sum shall be taxed as a part of the costs in the proceeding if the plaintiff shall prevail therein. The Secretary of State shall maintain an alphabetical record of any such service setting forth the name of the plaintiff and defendant, the title, docket number and nature of the proceeding in which process has been served upon the Secretary of State, the fact that service has been effected pursuant to this subsection, the return date thereof, and the day and hour when the service was made. The Secretary of State shall not be required to retain such information for a period longer than 5 years from receipt of the service of process."
    },
    {
      "number": "(e)",
      "content": "Section § 251(e) of this title shall apply to a merger under this section if the corporation surviving the merger is a corporation of this State."
    },
    {
      "number": "(f)",
      "content": "Section 251(d) of this title shall apply to a merger under this section; provided, however, that references to the board of directors, to stockholders, and to shares of a constituent corporation shall be deemed to be references to the governing body of the corporation, to members of the corporation, and to memberships or membership interests, as applicable, respectively."
    },
    {
      "number": "(g)",
      "content": "Nothing in this section shall be deemed to authorize the merger of a charitable nonstock corporation into a nonstock corporation, if the charitable status of such charitable nonstock corporation would thereby be lost or impaired; but a nonstock corporation may be merged into a charitable nonstock corporation which shall continue as the surviving corporation."
    }
  ],
  "history": [
    "8 Del. C. 1953, § 256",
    "56 Del. Laws, c. 50",
    "56 Del. Laws, c. 186, § 20",
    "57 Del. Laws, c. 148, § 25",
    "59 Del. Laws, c. 437, §§ 21, 22",
    "64 Del. Laws, c. 112, §§ 42, 43",
    "67 Del. Laws, c. 190, § 5",
    "67 Del. Laws, c. 376, § 18",
    "70 Del. Laws, c. 349, § 13",
    "70 Del. Laws, c. 587, § 23",
    "71 Del. Laws, c. 339, § 47",
    "74 Del. Laws, c. 84, § 16",
    "77 Del. Laws, c. 253, §§ 42, 43",
    "77 Del. Laws, c. 290, § 15"
  ]
}
