{
  "jurisdiction": "US-DE",
  "provision": [
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "IX"
    },
    {
      "subdivision": "section",
      "number": "266"
    }
  ],
  "heading": "Conversion of a domestic corporation to other entities",
  "content": [
    {
      "number": "(a)",
      "content": "A corporation of this State may, upon the authorization of such conversion in accordance with this section, convert to a limited liability company, statutory trust, business trust or association, real estate investment trust, common-law trust or any other unincorporated business including a partnership (whether general (including a limited liability partnership) or limited (including a limited liability limited partnership)) or a foreign corporation."
    },
    {
      "number": "(b)",
      "content": [
        {
          "type": "paragraph",
          "text": "The board of directors of the corporation which desires to convert under this section shall adopt a resolution approving such conversion, specifying the type of entity into which the corporation shall be converted and recommending the approval of such conversion by the stockholders of the corporation. Such resolution shall be submitted to the stockholders of the corporation at an annual or special meeting. Due notice of the time, and purpose of the meeting shall be mailed to each holder of stock, whether voting or nonvoting, of the corporation at the address of the stockholder as it appears on the records of the corporation, at least 20 days prior to the date of the meeting. At the meeting, the resolution shall be considered and a vote taken for its adoption or rejection. If all outstanding shares of stock of the corporation, whether voting or nonvoting, shall be voted for the adoption of the resolution, the conversion shall be authorized."
        },
        {
          "number": "(1)",
          "content": "[Repealed.]"
        },
        {
          "number": "(2)",
          "content": "[Repealed.]"
        },
        {
          "number": "(3)",
          "content": "[Repealed.]"
        },
        {
          "number": "(4)",
          "content": "[Repealed.]"
        }
      ]
    },
    {
      "number": "(c)",
      "content": [
        {
          "type": "paragraph",
          "text": "If a corporation shall convert in accordance with this section to another entity organized, formed or created under the laws of a jurisdiction other than the State of Delaware, the corporation shall file with the Secretary of State a certificate of conversion executed in accordance with § 103 of this title, which certifies:"
        },
        {
          "number": "(1)",
          "content": "The name of the corporation, and if it has been changed, the name under which it was originally incorporated;"
        },
        {
          "number": "(2)",
          "content": "The date of filing of its original certificate of incorporation with the Secretary of State;"
        },
        {
          "number": "(3)",
          "content": "The name and jurisdiction of the entity to which the corporation shall be converted;"
        },
        {
          "number": "(4)",
          "content": "That the conversion has been approved in accordance with the provisions of this section;"
        },
        {
          "number": "(5)",
          "content": "The agreement of the corporation that it may be served with process in the State of Delaware in any action, suit or proceeding for enforcement of any obligation of the corporation arising while it was a corporation of this State, and that it irrevocably appoints the Secretary of State as its agent to accept service of process in any such action, suit or proceeding; and"
        },
        {
          "number": "(6)",
          "content": "The address to which a copy of the process referred to in paragraph (c)(5) of this section shall be mailed to it by the Secretary of State. Process may be served upon the Secretary of State in accordance with paragraph (c)(5) of this section by means of electronic transmission but only as prescribed by the Secretary of State. The Secretary of State is authorized to issue such rules and regulations with respect to such service as the Secretary of State deems necessary or appropriate. In the event of such service upon the Secretary of State in accordance with paragraph (c)(5) of this section, the Secretary of State shall forthwith notify such corporation that has converted out of the State of Delaware by letter, directed to such corporation that has converted out of the State of Delaware at the address so specified, unless such corporation shall have designated in writing to the Secretary of State a different address for such purpose, in which case it shall be mailed to the last address designated. Such letter shall be sent by a mail or courier service that includes a record of mailing or deposit with the courier and a record of delivery evidenced by the signature of the recipient. Such letter shall enclose a copy of the process and any other papers served on the Secretary of State pursuant to this subsection. It shall be the duty of the plaintiff in the event of such service to serve process and any other papers in duplicate, to notify the Secretary of State that service is being effected pursuant to this subsection and to pay the Secretary of State the sum of $50 for the use of the State, which sum shall be taxed as part of the costs in the proceeding, if the plaintiff shall prevail therein. The Secretary of State shall maintain an alphabetical record of any such service setting forth the name of the plaintiff and the defendant, the title, docket number and nature of the proceeding in which process has been served, the fact that service has been effected pursuant to this subsection, the return date thereof, and the day and hour service was made. The Secretary of State shall not be required to retain such information longer than 5 years from receipt of the service of process."
        }
      ]
    },
    {
      "number": "(d)",
      "content": "Upon the filing in the Office of the Secretary of State of a certificate of conversion to non-Delaware entity in accordance with subsection (c) of this section or upon the future effective date or time of the certificate of conversion to non-Delaware entity and payment to the Secretary of State of all fees prescribed under this title, the Secretary of State shall certify that the corporation has filed all documents and paid all fees required by this title, and thereupon the corporation shall cease to exist as a corporation of this State at the time the certificate of conversion becomes effective in accordance with § 103 of this title. Such certificate of the Secretary of State shall be prima facie evidence of the conversion by such corporation out of the State of Delaware."
    },
    {
      "number": "(e)",
      "content": "The conversion of a corporation out of the State of Delaware in accordance with this section and the resulting cessation of its existence as a corporation of this State pursuant to a certificate of conversion to non-Delaware entity shall not be deemed to affect any obligations or liabilities of the corporation incurred prior to such conversion or the personal liability of any person incurred prior to such conversion, nor shall it be deemed to affect the choice of law applicable to the corporation with respect to matters arising prior to such conversion."
    },
    {
      "number": "(f)",
      "content": "Unless otherwise provided in a resolution of conversion adopted in accordance with this section, the converting corporation shall not be required to wind up its affairs or pay its liabilities and distribute its assets, and the conversion shall not constitute a dissolution of such corporation."
    },
    {
      "number": "(g)",
      "content": "In connection with a conversion of a domestic corporation to another entity pursuant to this section, shares of stock, of the corporation of this State which is to be converted may be exchanged for or converted into cash, property, rights or securities of, or interests in, the entity to which the corporation of this State is being converted or, in addition to or in lieu thereof, may be exchanged for or converted into cash, property, shares of stock, rights or securities of, or interests in, another domestic corporation or other entity or may be cancelled."
    },
    {
      "number": "(h)",
      "content": "When a corporation has been converted to another entity or business form pursuant to this section, the other entity or business form shall, for all purposes of the laws of the State of Delaware, be deemed to be the same entity as the corporation. When any conversion shall have become effective under this section, for all purposes of the laws of the State of Delaware, all of the rights, privileges and powers of the corporation that has converted, and all property, real, personal and mixed, and all debts due to such corporation, as well as all other things and causes of action belonging to such corporation, shall remain vested in the other entity or business form to which such corporation has converted and shall be the property of such other entity or business form, and the title to any real property vested by deed or otherwise in such corporation shall not revert or be in any way impaired by reason of this chapter; but all rights of creditors and all liens upon any property of such corporation shall be preserved unimpaired, and all debts, liabilities and duties of the corporation that has converted shall remain attached to the other entity or business form to which such corporation has converted, and may be enforced against it to the same extent as if said debts, liabilities and duties had originally been incurred or contracted by it in its capacity as such other entity or business form. The rights, privileges, powers and interest in property of the corporation that has converted, as well as the debts, liabilities and duties of such corporation, shall not be deemed, as a consequence of the conversion, to have been transferred to the other entity or business form to which such corporation has converted for any purpose of the laws of the State of Delaware."
    },
    {
      "number": "(i)",
      "content": "No vote of stockholders of a corporation shall be necessary to authorize a conversion if no shares of the stock of such corporation shall have been issued prior to the adoption by the board of directors of the resolution approving the conversion."
    },
    {
      "number": "(j)",
      "content": "Nothing in this section shall be deemed to authorize the conversion of a charitable nonstock corporation into another entity, if the charitable status of such charitable nonstock corporation would thereby be lost or impaired."
    }
  ],
  "history": [
    "72 Del. Laws, c. 123, § 11",
    "73 Del. Laws, c. 82, §§ 30-32",
    "73 Del. Laws, c. 329, § 46",
    "74 Del. Laws, c. 84, § 20",
    "75 Del. Laws, c. 30, §§ 19-27",
    "77 Del. Laws, c. 253, § 57",
    "77 Del. Laws, c. 290, § 22"
  ]
}
