{
  "jurisdiction": "US-DE",
  "provision": [
    {
      "subdivision": "code",
      "number": "Delaware Code"
    },
    {
      "subdivision": "title",
      "number": "8"
    },
    {
      "subdivision": "chapter",
      "number": "1"
    },
    {
      "subdivision": "subchapter",
      "number": "IX"
    },
    {
      "subdivision": "section",
      "number": "267"
    }
  ],
  "heading": "Merger of parent entity and subsidiary corporation or corporations",
  "content": [
    {
      "number": "(a)",
      "content": [
        {
          "type": "paragraph",
          "text": "In any case in which:"
        },
        {
          "number": "(1)",
          "content": "at least 90% of the outstanding shares of each class of the stock of a corporation or corporations (other than a corporation which has in its certificate of incorporation the provision required by § 251(g)(7)(i) of this title), of which class there are outstanding shares that, absent this subsection, would be entitled to vote on such merger, is owned by an entity,"
        },
        {
          "number": "(2)",
          "content": "1 or more of such corporations is a corporation of this State, and"
        },
        {
          "number": "(3)",
          "content": "any entity or corporation that is not an entity or corporation of this State is an entity or corporation of any other state or the District of Columbia, the laws of which do not forbid such merger, the entity having such stock ownership may either merge the corporation or corporations into itself and assume all of its or their obligations, or merge itself, or itself and 1 or more of such corporations, into 1 of the other corporations by"
        },
        {
          "number": "(a)",
          "content": "authorizing such merger in accordance with such entity’s governing documents and the laws of the jurisdiction under which such entity is formed or organized and"
        },
        {
          "number": "(b)",
          "content": "acknowledging and filing with the Secretary of State, in accordance with § 103 of this title, a certificate of such ownership and merger certifying"
        },
        {
          "number": "(i)",
          "content": "that such merger was authorized in accordance with such entity’s governing documents and the laws of the jurisdiction under which such entity is formed or organized, such certificate executed in accordance with such entity’s governing documents and in accordance with the laws of the jurisdiction under which such entity is formed or organized and"
        },
        {
          "number": "(ii)",
          "content": "the type of entity of each constituent entity to the merger; provided, however, that in case the entity shall not own all the outstanding stock of all the corporations, parties to a merger as aforesaid,"
        },
        {
          "number": "(A)",
          "content": "the certificate of ownership and merger shall state the terms and conditions of the merger, including the securities, cash, property, or rights to be issued, paid, delivered or granted by the surviving constituent party upon surrender of each share of the corporation or corporations not owned by the entity, or the cancellation of some or all of such shares and"
        },
        {
          "number": "(B)",
          "content": "such terms and conditions of the merger may not result in a holder of stock in a corporation becoming a general partner in a surviving entity that is a partnership (other than a limited liability partnership or a limited liability limited partnership). Any of the terms of the merger may be made dependent upon facts ascertainable outside of the certificate of ownership and merger, provided that the manner in which such facts shall operate upon the terms of the merger is clearly and expressly set forth in the certificate of ownership and merger. The term “facts,” as used in the preceding sentence, includes, but is not limited to, the occurrence of any event, including a determination or action by any person or body, including the entity. If the surviving constituent party exists under the laws of the District of Columbia or any state or jurisdiction other than this State,"
        },
        {
          "number": "(1)",
          "content": "§ 252(d) of this title shall also apply to a merger under this section; if the surviving constituent party is the entity, the word “corporation” where applicable, as used in § 252(d) of this title, shall be deemed to include an entity as defined herein; and"
        },
        {
          "number": "(2)",
          "content": "the terms and conditions of the merger shall obligate the surviving constituent party to provide the agreement, and take the actions, required by § 252(d) of this title."
        }
      ]
    },
    {
      "number": "(b)",
      "content": "Sections 259, 261, and 328 of this title shall, insofar as they are applicable, apply to a merger under this section, and §§ 260 and 251(e) of this title shall apply to a merger under this section in which the surviving constituent party is a corporation of this State. For purposes of this subsection, references to “agreement of merger” in § 251(e) of this title shall mean the terms and conditions of the merger set forth in the certificate of ownership and merger, and references to “corporation” in §§ 259-261 of this title, and § 328 of this title shall be deemed to include the entity, as applicable. Section 262 of this title shall not apply to any merger effected under this section, except as provided in subsection (c) of this section."
    },
    {
      "number": "(c)",
      "content": "In the event all of the stock of a Delaware corporation party to a merger effected under this section is not owned by the entity immediately prior to the merger, the stockholders of such Delaware corporation party to the merger shall have appraisal rights as set forth in § 262 of this title."
    },
    {
      "number": "(d)",
      "content": "A merger may be effected under this section although 1 or more of the constituent parties is a corporation organized under the laws of a jurisdiction other than 1 of the United States; provided that the laws of such jurisdiction do not forbid such merger."
    },
    {
      "number": "(e)",
      "content": [
        {
          "type": "paragraph",
          "text": "As used in this section only, the term:"
        },
        {
          "number": "(1)",
          "content": "“Constituent party” means an entity or corporation to be merged pursuant to this section;"
        },
        {
          "number": "(2)",
          "content": "“Entity” means a partnership (whether general (including a limited liability partnership) or limited (including a limited liability limited partnership)), limited liability company, any association of the kind commonly known as a joint-stock association or joint-stock company and any unincorporated association, trust or enterprise having members or having outstanding shares of stock or other evidences of financial or beneficial interest therein, whether formed by agreement or under statutory authority or otherwise; and"
        },
        {
          "number": "(3)",
          "content": "“Governing documents” means a partnership agreement, limited liability company agreement, articles of association or any other instrument containing the provisions by which an entity is formed or organized."
        }
      ]
    }
  ],
  "history": [
    "77 Del. Laws, c. 290, § 23",
    "78 Del. Laws, c. 273, § 4"
  ]
}
